<script setup>
import UnitPicInfo from "@/components/party/components/UnitPicInfo.vue";
import {unit_data} from "@/components/party_manager";

const up_data_fire = [
  {
    id: 3,
    content: {
      '技能': [
        '技能能量：<or>650</or>',
        '技能能量：<hl>550</hl>',
      ],
      '队长': [
        '<or>火属性角色攻击力 + 40%</or>\n<or>强化弹射伤害 + 40%</or>',
        '<hl>火属性角色攻击力 + 100%</hl>\n<hl>强化弹射伤害 + 70%</hl>',
      ],
      '能力2': [
        '5 次Power Flip（强化弹射）时，<or>自身攻击力 + 10%[最大 + 60%]</or>',
        '5 次Power Flip（强化弹射）时，<hl>自身攻击力 + 15%[最大 + 90%]</hl>',
      ]
    }
  },
  {
    id: 4,
    content: {
      '技能': [
        '召唤出的协力球基本HP：<or>673</or>',
        '召唤出的协力球基本HP：<hl>840</hl>',
      ],
      '队长': [
        '<or>火属性角色生命值 + 15%</or> & <or>攻击力 + 30%</or>\n20 次弹射时，<or>火属性角色攻击力 + 5%[最大 + 25%]</or>',
        '<hl>火属性角色生命值 + 20%</hl> & <hl>攻击力 + 50%</hl>\n20 次弹射时，<hl>火属性角色攻击力 + 12.5%[最大 + 50%]</hl>',
      ],
      '能力1': [
        '<or>自身攻击力 + 30%</or>',
        '<hl>自身攻击力 + 55%</hl>',
      ]
    }
  },
  {
    id: 5,
    content: {
      '队长': [
        '<or>火属性角色技能伤害 + 125%</or>',
        '<hl>火属性角色技能伤害 + 200%</hl>',
      ]
    }
  },
  {
    id: 119,
    content: {
      '技能': [
        '-',
        '<hl>技能的停止时间缩短</hl>',
      ],
      '队长': [
        '<or>火属性角色攻击力 + 30%</or> & 强化效果时间 + 25%',
        '<hl>火属性角色攻击力 + 50%</hl> & 强化效果时间 + 25%',
      ]
    }
  },
  {
    id: 133,
    content: {
      '队长': [
        '火属性角色攻击力 + 30%\n协力球攻击力 + 40% & 生命值 + 10%',
        '<hl>火属性角色攻击力 + 80%</hl>\n协力球攻击力 + 40% & 生命值 + 10%',
      ]
    }
  },
  {
    id: 143,
    content: {
      '队长': [
        '<or>火属性角色攻击力 + 30%</or>\n<or>强化弹射伤害 + 65%</or>',
        '<hl>火属性角色攻击力 + 60%</hl>\n<hl>强化弹射伤害 + 100%</hl>',
      ]
    }
  },
  {
    id: 208,
    content: {
      '队长': [
        '火属性角色生命值 + 20% & <or>技能伤害 + 40%</or>',
        '火属性角色生命值 + 20% & <hl>技能伤害 + 60%</hl>',
      ],
      '能力2': [
        '每当火属性角色承受 5 次伤害时，<or>该角色技能伤害 + 5%[最大 + 25%]</or>\n火属性角色生命值 + 5%',
        '每当火属性角色承受 5 次伤害时，<hl>该角色技能伤害 + 6%[最大 + 30%]</hl>\n火属性角色生命值 + 5%',
      ],
      '能力3': [
        '作为主要角色编成：每当火属性角色承受 5 次伤害时，<or>该角色技能伤害 + 6%[最大 + 30%]</or>\n作为主要角色编成：10 次冲刺时，<or>火属性角色攻击力 + 6%[最大 + 30%]</or>',
        '作为主要角色编成：每当火属性角色承受 5 次伤害时，<hl>该角色技能伤害 + 6%[最大 + 36%]</hl>\n作为主要角色编成：10 次冲刺时，<hl>火属性角色攻击力 + 6%[最大 + 36%]</hl>',
      ],
      '能力4': [
        '战斗开始时，自身技能槽 + 35%',
        '战斗开始时，自身技能槽 + 35% & <hl>棺柩计数 - 2</hl>',
      ]
    }
  },
  {
    id: 238,
    content: {
      '队长': [
        '队伍中编入 3 名以上种族为“龙”角色时，<or>队伍全体攻击力 + 90%</or>',
        '队伍中编入 3 名以上种族为“龙”角色时，<hl>队伍全体攻击力 + 180%</hl>',
      ]
    }
  },
  {
    id: 252,
    content: {
      '技能': [
        '挥舞斧枪叩击地面，对自身正面的敌人造成火属性伤害(16x / 1hit) / 以叩击造成的冲击振动大地，<or>对周围的敌人造成火属性伤害(5x / 3hit)</or> / 赋予全体队员攻击力提升(75% / 15s)效果',
        '挥舞斧枪叩击地面，对自身正面的敌人造成火属性伤害(16x / 1hit) / 以叩击造成的冲击振动大地，<hl>对周围的敌人造成火属性伤害(12x / 5hit)</hl> / 赋予全体队员攻击力提升(75% / 15s)效果',
      ],
      '队长': [
        '<or>火属性角色攻击力 + 40%</or>\n每当自身承受 15 次伤害时，<or>火属性角色攻击力 + 8%[最大 + 80%]</or>',
        '<hl>火属性角色攻击力 + 60%</hl>\n每当自身承受 15 次伤害时，<hl>火属性角色攻击力 + 14%[最大 + 140%]</hl>',
      ],
      '能力1': [
        '<or>自身攻击力 + 20%</or>\n每当自身承受 10 次伤害时，<or>自身攻击力 + 5%[最大 + 60%]</or>',
        '<hl>自身攻击力 + 30%</hl>\n每当自身承受 10 次伤害时，<hl>自身攻击力 + 7%[最大 + 70%]</hl>',
      ],
      '能力2': [
        '<or>自身风属性抗性 + 25%</or>',
        '<hl>自身风属性抗性 + 30%</hl>',
      ],
      '能力3': [
        '作为主要角色编成：<or>自身攻击力 + 60%</or> & 风属性抗性 + 30% & 自身代替除自身外的角色承受 50% 伤害',
        '作为主要角色编成：<hl>自身攻击力 + 80%</hl> & 风属性抗性 + 30% & 自身代替除自身外的角色承受 50% 伤害',
      ]
    }
  },
  {
    id: 258,
    content: {
      '技能': [
        '技能能量：<or>600</or>',
        '技能能量：<hl>570</hl>',
      ],
      '队长': [
        '<or>火属性角色生命值 + 15%</or> & <or>攻击力 + 40%</or>',
        '<hl>火属性角色生命值 + 20%</hl> & <hl>攻击力 + 80%</hl>',
      ],
      '能力1': [
        '<or>火属性角色生命值 + 10%</or>',
        '<hl>火属性角色生命值 + 15%</hl>',
      ],
      '能力3': [
        '作为主要角色编成：自身发动技能时，<or>火属性角色攻击力 + 12.5%[最大 + 50%]</or> & 所受的回复量 + 5%[最大 + 20%]',
        '作为主要角色编成：自身发动技能时，<hl>火属性角色攻击力 + 17.5%[最大 + 70%]</hl> & 所受的回复量 + 5%[最大 + 20%]',
      ]
    }
  },
  {
    id: 266,
    content: {
      '队长': [
        '战斗开始时，火属性角色技能槽 + 50% & 协力球生命值 + 10%\n火属性角色发动技能时，<or>协力球攻击力 + 5%[最大 + 50%]</or>',
        '战斗开始时，火属性角色技能槽 + 50% & 协力球生命值 + 10%\n火属性角色发动技能时，<hl>协力球攻击力 + 10%[最大 + 100%]</hl>',
      ]
    }
  },
  {
    id: 1,
    content: {
      '队长': [
        '编入队伍中的角色属性每增加 1 种时，<or>队伍全体攻击力 + 8%[最大 + 48%]</or>',
        '编入队伍中的角色属性每增加 1 种时，<hl>队伍全体攻击力 + 25%[最大 + 150%]</hl>',
      ],
      '能力1': [
        '<or>队伍全体攻击力 + 10%</or>',
        '<hl>队伍全体攻击力 + 20%</hl>',
      ],
      '能力3': [
        '作为主要角色编成：自身发动技能时，<or>自身攻击力 + 30%[最大 + 120%]</or>',
        '作为主要角色编成：自身发动技能时，<hl>自身攻击力 + 45%[最大 + 180%]</hl>',
      ],
    }
  },
  {
    id: 19,
    content: {
      '队长': [
        '<or>火属性角色攻击力 + 30%</or> & 对种族为“龙”的敌人造成的伤害 + 25%（独立伤害乘区1）',
        '<hl>火属性角色攻击力 + 40%</hl> & 对种族为“龙”的敌人造成的伤害 + 25%（独立伤害乘区1）',
      ],
      '能力1': [
        '<or>自身攻击力 + 25%</or>',
        '<hl>自身攻击力 + 45%</hl>',
      ],
    }
  },
  {
    id: 20,
    content: {
      '队长': [
        '队伍中编入 2 名以上种族为“龙”角色时，<or>队伍全体攻击力 + 65%</or>',
        '队伍中编入 2 名以上种族为“龙”角色时，<hl>队伍全体攻击力 + 120%</hl>',
      ],
      '能力3': [
        '<or>种族为“龙”角色攻击力 + 40%</or>',
        '<hl>种族为“龙”角色攻击力 + 80%</hl>',
      ]
    }
  },
  {
    id: 21,
    content: {
      '能力1': [
        '每当达成 30 COMBO（连击）时，<or>自身攻击力 + 8%[最大 + 40%]</or>',
        '每当达成 30 COMBO（连击）时，<hl>自身攻击力 + 12%[最大 + 60%]</hl>',
      ]
    }
  },
  {
    id: 22,
    content: {
      '技能': [
        '技能能量：<or>650</or>',
        '技能能量：<hl>550</hl>',
      ],
      '队长': [
        '<or>火属性角色攻击力 + 50%</or>',
        '<hl>火属性角色攻击力 + 120%</hl>',
      ],
      '能力1': [
        '<or>自身攻击力 + 25%</or>',
        '<hl>自身攻击力 + 45%</hl>',
      ],
      '能力2': [
        '每击败5个敌人，<or>自身攻击力 + 6%[最大 + 60%]</or>',
        '每击败5个敌人，<hl>自身攻击力 + 10%[最大 + 60%]</hl>',
      ],
      '能力3': [
        '作为主要角色编成：强化弹射Lv3所需要的连击数量 - 3 & <or>自身攻击力 + 40%</or>',
        '作为主要角色编成：强化弹射Lv3所需要的连击数量 - 3 & <hl>自身攻击力 + 70%</hl>',
      ]
    }
  },
  {
    id: 23,
    content: {
      '技能': [
        '技能能量：<or>560</or>',
        '技能能量：<hl>530</hl>',
      ],
      '队长': [
        '<or>强化弹射伤害 + 100%</or>',
        '<hl>强化弹射伤害 + 150%</hl>',
      ],
    }
  },
  {
    id: 115,
    content: {
      '队长': [
        '10 COMBO（连击）以上时，<or>火属性角色攻击力 + 125%</or>',
        '10 COMBO（连击）以上时，<hl>火属性角色攻击力 + 140%</hl>',
      ],
      '能力1': [
        '<or>自身攻击力 + 25%</or>',
        '<hl>自身攻击力 + 45%</hl>',
      ],
    }
  },
  {
    id: 121,
    content: {
      '技能': [
        '鼓起干劲，新春试笔！<or>队伍全体获得强化弹射伤害提升效果(100% / 25s)</or>',
        '鼓起干劲，新春试笔！<hl>队伍全体获得强化弹射伤害提升效果(120% / 25s)</hl>',
      ],
      '队长': [
        '<or>强化弹射伤害 + 70%</or>\n火属性角色的强化效果时间 + 10%',
        '<hl>强化弹射伤害 + 90%</hl>\n火属性角色的强化效果时间 + 10%',
      ],
      '能力1': [
        '5 次Power Flip（强化弹射）时，<or>火属性角色攻击力 + 5%[最大 + 25%]</or>',
        '5 次Power Flip（强化弹射）时，<hl>火属性角色攻击力 + 8%[最大 + 40%]</hl>',
      ],
    }
  },
  {
    id: 135,
    content: {
      '队长': [
        '<or>队伍全体攻击力 + 40%</or>',
        '<hl>队伍全体攻击力 + 100%</hl>',
      ]
    }
  },
  {
    id: 167,
    content: {
      '队长': [
          '<or>火属性角色攻击力 + 30%</or>\n火属性角色发动技能时，<or>火属性角色攻击力 + 5%[最大 + 50%]</or>',
          '<hl>火属性角色攻击力 + 60%</hl>\n火属性角色发动技能时，<hl>火属性角色攻击力 + 10%[最大 + 100%]</hl>',
      ],
      '能力1': [
          '自身发动技能时，<or>自身攻击力 + 15%[最大 + 60%]</or>',
          '自身发动技能时，<hl>自身攻击力 + 20%[最大 + 80%]</hl>',
      ],
      '能力2': [
          '火属性角色发动技能时，<or>自身攻击力 + 5%[最大 + 60%]</or>',
          '火属性角色发动技能时，<hl>自身攻击力 + 7%[最大 + 70%]</hl>',
      ]
    }
  },
  {
    id: 173,
    content: {
      '技能': [
        '射出信号弹，请求海盗船对目标位置进行连续支援射击，对命中的敌人造成火属性伤害(16x / 20hit)',
        '射出信号弹，请求海盗船对目标位置进行连续支援射击，对命中的敌人造成火属性伤害(16x / 20hit) / <hl>赋予火属性角色攻击力提升效果(50% / 15s)</hl>',
      ],
      '队长': [
        '火属性角色生命值 + 15% & <or>攻击力 + 30%</or>',
        '火属性角色生命值 + 15% & <hl>攻击力 + 65%</hl>',
      ],
    }
  },
  {
    id: 180,
    content: {
      '技能': [
        '技能能量：<or>590</or>',
        '技能能量：<hl>550</hl>',
      ],
      '队长': [
        '<or>火属性角色攻击力 + 30%</or>\n贯穿效果期间，<or>火属性角色攻击力 + 45%</or>',
        '<hl>火属性角色攻击力 + 60%</hl>\n贯穿效果期间，<hl>火属性角色攻击力 + 75%</hl>',
      ],
      '能力2': [
        '每击败5个敌人时，<or>自身攻击力 + 6%[最大 + 60%]</or>',
        '每击败5个敌人时，<hl>自身攻击力 + 10%[最大 + 60%]</hl>',
      ],
      '能力3': [
        '作为主要角色编成：贯穿效果期间，<or>火属性角色攻击力 + 60%</or>',
        '作为主要角色编成：贯穿效果期间，<hl>火属性角色攻击力 + 75%</hl>',
      ]
    }
  },
  {
    id: 199,
    content: {
      '队长': [
        '<or>火属性角色技能伤害 + 100%</or>',
        '<hl>火属性角色技能伤害 + 150%</hl>',
      ],
    }
  },
  {
    id: 204,
    content: {
      '队长': [
        '<or>火属性角色生命值 + 12%</or> & <or>攻击力 + 30%</or>',
        '<hl>火属性角色生命值 + 15%</hl> & <hl>攻击力 + 65%</hl>',
      ],
      '能力1': [
        '10 COMBO（连击）以上时，<or>自身直接攻击伤害 + 100%</or>',
        '10 COMBO（连击）以上时，<hl>自身直接攻击伤害 + 110%</hl>',
      ],
      '能力2': [
        '<or>自身直接攻击伤害 + 60%</or>',
        '<hl>自身直接攻击伤害 + 80%</hl>',
      ],
    }
  },
  {
    id: 219,
    content: {
      '队长': [
        '火属性角色发动技能时，<or>该角色技能伤害 + 30%[最大 + 90%]</or>\n战斗开始时，火属性角色技能槽 + 50%',
        '火属性角色发动技能时，<hl>该角色技能伤害 + 40%[最大 + 120%]</hl>\n战斗开始时，火属性角色技能槽 + 50%'
      ]
    }
  },
  {
    id: 235,
    content: {
      '队长': [
        '编入队伍中的角色的属性每增加 1 种时，<or>队伍全体攻击力 + 5%[最大 + 30%]</or> & 生命值 + 2.5%[最大 + 15%]',
        '编入队伍中的角色的属性每增加 1 种时，<hl>队伍全体攻击力 + 15%[最大 + 90%]</hl> & 生命值 + 2.5%[最大 + 15%]',
      ],
      '能力1': [
        '<or>强化弹射伤害 + 25%</or>',
        '<hl>强化弹射伤害 + 30%</hl>',
      ],
    }
  },
  {
    id: 240,
    content: {
      '技能': [
        '技能能量：<or>590</or>',
        '技能能量：<hl>550</hl>',
      ],
      '队长': [
        '<or>火属性角色攻击力 + 30%</or>\n贯穿效果期间，<or>火属性角色攻击力 + 60%</or>',
        '<hl>火属性角色攻击力 + 60%</hl>\n贯穿效果期间，<hl>火属性角色攻击力 + 100%</hl>',
      ],
      '能力1': [
        '<or>强化弹射伤害 + 25%</or>',
        '<hl>强化弹射伤害 + 30%</hl>',
      ],
      '能力2': [
        '贯穿效果期间，<or>火属性角色攻击力 + 30%</or>',
        '贯穿效果期间，<hl>火属性角色攻击力 + 35%</hl>',
      ]
    }
  },
]
const up_data_water = [
  {
    id: 6,
    content: {
      '队长': [
        '<or>水属性角色攻击力 + 30%</or>\n每当达成 30 COMBO（连击）时，<or>水属性角色攻击力 + 12%[最大 + 60%]</or>',
        '<hl>水属性角色攻击力 + 60%</hl>\n每当达成 30 COMBO（连击）时，<hl>水属性角色攻击力 + 24%[最大 + 120%]</hl>',
      ]
    }
  },
  {
    id: 7,
    content: {
      '队长': [
        '水属性角色生命值 + 40%',
        '水属性角色生命值 + 40% & <hl>攻击力 + 40%</hl>',
      ]
    }
  },
  {
    id: 120,
    content: {
      '队长': [
        '<or>水属性角色攻击力 + 40%</or> & <or>技能伤害 + 40%</or>',
        '<hl>水属性角色攻击力 + 60%</hl> & <hl>技能伤害 + 120%</hl>',
      ],
      '能力2': [
        '每当达成 30 COMBO（连击）时，<or>自身攻击力 + 10%[最大 + 60%]</or>',
        '每当达成 30 COMBO（连击）时，<hl>自身攻击力 + 12.5%[最大 + 75%]</hl>',
      ]
    }
  },
  {
    id: 127,
    content: {
      '队长': [
        '<or>水属性角色攻击力 + 100%</or>\n水属性角色的生命值低于 80% 时，（仅1次）该角色回复最大生命值的 20%',
        '<hl>水属性角色攻击力 + 120%</hl>\n水属性角色的生命值低于 80% 时，（仅1次）该角色回复最大生命值的 20%',
      ]
    }
  },
  {
    id: 139,
    content: {
      '技能': [
        '向最近的敌方发射多段式弹道导弹，对周围的敌方造成水属性伤害(22.5x / 8hit) / <or>赋予自身攻击力提升效果(100% / 15s)</or>',
        '向最近的敌方发射多段式弹道导弹，对周围的敌方造成水属性伤害(22.5x / 8hit) / <hl>赋予水属性角色攻击力提升效果(100% / 15s)</hl>',
      ],
      '队长': [
        '<or>水属性角色攻击力 + 40%</or> & <or>直接攻击伤害 + 60%</or>',
        '<hl>水属性角色攻击力 + 60%</hl> & <hl>直接攻击伤害 + 160%</hl>',
      ],
      '能力3': [
        '作为主要角色编成：自身生命值 50% 以上时，<or>水属性角色直接攻击伤害 + 60%</or>\n作为主要角色编成：自身生命值 80% 以上时，<or>自身直接攻击伤害 + 120%</or>',
        '作为主要角色编成：自身生命值 50% 以上时，<hl>水属性角色直接攻击伤害 + 70%</hl>\n作为主要角色编成：自身生命值 80% 以上时，<hl>自身直接攻击伤害 + 150%</hl>',
      ]
    }
  },
  {
    id: 152,
    content: {
      '技能': [
          '挥舞巨枪，向前方施展连续突刺，<or>对命中的敌人造成水属性伤害(15x / 13hit)</or> / 赋予己方贯穿(10s)效果 / 赋予自身<or>直接攻击伤害提升(100% / 15s)</or>效果',
          '挥舞巨枪，向前方施展连续突刺，<hl>对命中的敌人造成水属性伤害(18x / 13hit)</hl> / 赋予己方贯穿(10s)效果 / 赋予自身<hl>直接攻击伤害提升(120% / 15s)</hl>效果',
          ''
      ],
      '能力1': [
        '每当自身直接攻击 10 次时，<or>自身直接攻击伤害 + 10%[最大 + 150%]</or>',
        '每当自身直接攻击 10 次时，<hl>自身直接攻击伤害 + 20%[最大 + 160%]</hl>',
      ],
      '能力2': [
        '自身是水属性角色时，贯穿效果期间，<or>自身直接攻击伤害 + 120%</or>',
        '自身是水属性角色时，贯穿效果期间，<hl>自身直接攻击伤害 + 150%</hl>',
      ],
      '能力3': [
        '作为主要角色编成：自身获得的攻击提升效果每达到 1 个，<or>自身直接攻击伤害 + 50%[最大 + 250%]</or>',
        '作为主要角色编成：自身获得的攻击提升效果每达到 1 个，<hl>自身直接攻击伤害 + 80%[最大 + 400%]</hl>',
      ]
    }
  },
  {
    id: 161,
    content: {
      '队长': [
        '水属性角色发动技能时，<or>水属性角色攻击力 + 10%[最大 + 120%]</or>',
        '水属性角色发动技能时，<hl>水属性角色攻击力 + 17.5%[最大 + 210%]</hl>',
      ]
    }
  },
  {
    id: 198,
    content: {
      '队长': [
        '水属性角色生命值 + 10%\n水属性角色生命值 80% 以上时，<or>该角色攻击力 + 100%</or>',
        '水属性角色生命值 + 10%\n水属性角色生命值 80% 以上时，<hl>该角色攻击力 + 150%</hl>',
      ]
    }
  },
  {
    id: 206,
    content: {
      '技能': [
        '一辆疾驰的卡车突然出现于自身前方，<or>对冲撞到的敌人造成水属性伤害(19x / 5hit)</or> / 赋予<or>强化弹射伤害提升(75% / 20s)</or>效果',
        '一辆疾驰的卡车突然出现于自身前方，<hl>对冲撞到的敌人造成水属性伤害(19x / 8hit)</hl> / 赋予<hl>强化弹射伤害提升(100% / 20s)</hl>效果',
      ],
      '队长': [
        '进入Fever模式时，<or>获得20秒Power Flip（强化弹射）伤害 + 60%</or>\n水属性角色生命值 + 20%',
        '进入Fever模式时，<hl>获得20秒Power Flip（强化弹射）伤害 + 200%</hl>\n水属性角色生命值 + 20%',
      ],
      '能力3': [
        '作为主要角色编成：进入Fever模式时，<or>获得20秒Power Flip（强化弹射）伤害 + 250%</or>',
        '作为主要角色编成：进入Fever模式时，<hl>获得20秒Power Flip（强化弹射）伤害 + 280%</hl>',
      ],
      '能力4': [
        '战斗开始时，自身技能槽 + 50%',
        '战斗开始时，自身技能槽 + 50% & <hl>棺柩计数 - 2</hl>',
      ]
    }
  },
  {
    id: 236,
    content: {
      '技能': [
        '发动魔眼对距离最近的敌人及其周围的敌人造成水属性伤害(1x / 1hit) + 赋予<or>累计水属性抗性降低(7% / 50s)[可叠加 / 最大 21%]</or> + <or>累计攻击力降低(5% / 50s)[可叠加 / 最大 15%]</or>效果 / 发动后施展回旋斩冲向距离最近的敌人，对自身周围的敌人造成水属性伤害(15x / 3hit)',
        '发动魔眼对距离最近的敌人及其周围的敌人造成水属性伤害(1x / 1hit) + 赋予<hl>累计水属性抗性降低(7% / 55s)[可叠加 / 最大 21%]</hl> + <hl>累计攻击力降低(5% / 55s)[可叠加 / 最大 15%]</hl>效果 / 发动后施展回旋斩冲向距离最近的敌人，对自身周围的敌人造成水属性伤害(15x / 3hit)',
      ],
      '队长': [
        '<or>水属性角色攻击力 + 40%</or>\n水属性角色获得的攻击提升效果每达到1个，<or>该角色直接攻击伤害 + 30%[最大 + 150%]</or>',
        '<hl>水属性角色攻击力 + 60%</hl>\n水属性角色获得的攻击提升效果每达到1个，<hl>该角色直接攻击伤害 + 50%[最大 + 250%]</hl>',
      ],
      '能力1': [
        '自身获得的攻击提升效果每达到1个，<or>自身攻击力 + 16%[最大 + 80%]</or>',
        '自身获得的攻击提升效果每达到1个，<hl>自身攻击力 + 20%[最大 + 100%]</hl>',
      ],
      '能力2': [
        '自身是水属性角色时，自身获得攻击提升效果时，获得<or>15秒</or>自身的攻击力 + 80%（CT: 30 秒）',
        '自身是水属性角色时，自身获得攻击提升效果时，获得<hl>20秒</hl>自身的攻击力 + 80%（CT: 30 秒）',
      ],
      '能力3': [
        '作为主要角色编成：<or>自身对弱体效果中的敌人造成的直接攻击伤害 + 200%</or>',
        '作为主要角色编成：<hl>自身对弱体效果中的敌人造成的直接攻击伤害 + 300%</hl>',
      ]
    }
  },
  {
    id: 262,
    content: {
      '技能': [
        '向前方挥出蓄满了劲气的拳，<or>对命中的敌人造成水属性伤害(29x / 1hit)</or>',
        '向前方挥出蓄满了劲气的拳，<hl>对命中的敌人造成水属性伤害(33x / 1hit)</hl>',
      ],
      '队长': [
        '水属性角色的剩余生命值越多，该角色攻击力提升【<or>生命值从0%每增加1%，攻击力 + 1.5%[最大 + 150%]</or>】',
        '水属性角色的剩余生命值越多，该角色攻击力提升【<hl>生命值从0%每增加1%，攻击力 + 2%[最大 + 200%]</hl>】',
      ],
      '能力2': [
        '自身发动技能时，自身火属性抗性 + 10%[最大 + 20%] & <or>技能伤害 + 15%[最大 + 30%]</or>',
        '自身发动技能时，自身火属性抗性 + 10%[最大 + 20%] & <hl>技能伤害 + 25%[最大 + 50%]</hl>',
      ],
      '能力3': [
        '作为主要角色编成：自身的剩余生命值越多，自身攻击力提升【<or>生命值从0%每增加1%，攻击力 + 1.6%[最大 + 160%]</or>】',
        '作为主要角色编成：自身的剩余生命值越多，自身攻击力提升【<hl>生命值从0%每增加1%，攻击力 + 2%[最大 + 200%]</hl>】',
      ],
    }
  },
  {
    id: 271,
    content: {
      '队长': [
        '水属性角色获得的攻击提升效果每达到1个，<or>该角色直接攻击伤害 + 50%[最大 + 250%]</or>\n水属性角色的攻击提升效果时间 + 10%',
        '水属性角色获得的攻击提升效果每达到1个，<hl>该角色直接攻击伤害 + 70%[最大 + 350%]</hl>\n水属性角色的攻击提升效果时间 + 10%',
      ],
      '能力1': [
        '自身获得的攻击提升效果每达到1个，<or>自身直接攻击伤害 + 25%[最大 + 150%]</or>',
        '自身获得的攻击提升效果每达到1个，<hl>自身直接攻击伤害 + 30%[最大 + 180%]</hl>',
      ],
      '能力3': [
        '作为主要角色编成：水属性角色的攻击提升效果时间 + 20%\n作为主要角色编成：自身获得的攻击提升效果每达到1个，<or>自身直接攻击伤害 + 30%[最大 + 180%]</or>',
        '作为主要角色编成：水属性角色的攻击提升效果时间 + 20%\n作为主要角色编成：自身获得的攻击提升效果每达到1个，<hl>自身直接攻击伤害 + 35%[最大 + 210%]</hl>',
      ],
    }
  },
  {
    id: 24,
    content: {
      '技能': [
        '在自身周围释放冰块，一定时间内(10s)对接近的敌人造成水属性伤害(15x / 10hit) + 赋予迟缓效果(20s)\n技能能量：<or>620</or>',
        '在自身周围释放冰块，一定时间内(10s)对接近的敌人造成水属性伤害(15x / 10hit) + 赋予迟缓效果(20s) / <hl>赋予队伍全体攻击力提升(50% / 15s)效果</hl> \n技能能量：<hl>530</hl>',
      ],
      '队长': [
        '水属性角色生命值 + 15% & <or>攻击力 + 30%</or>',
        '水属性角色生命值 + 15% & <hl>攻击力 + 65%</hl>',
      ],
      '能力1': [
        '自身生命值 50% 以上时，<or>队伍全体攻击力 + 15%</or>',
        '自身生命值 50% 以上时，<hl>队伍全体攻击力 + 25%</hl>',
      ],
      '能力2': [
        '自身处于在攻击提升效果期间，<or>队伍全体攻击力 + 20%</or>',
        '自身处于在攻击提升效果期间，<hl>队伍全体攻击力 + 30%</hl>',
      ]
    }
  },
  {
    id: 25,
    content: {
      '队长': [
        '<or>队伍全体攻击力 + 25%</or> & 所受的回复量 + 15%',
        '<hl>队伍全体攻击力 + 60%</hl> & 所受的回复量 + 15%',
      ],
      '能力1': [
        '<or>水属性角色生命值 + 8%</or>',
        '<hl>水属性角色生命值 + 10%</hl>',
      ],
      '能力2': [
        '水属性角色生命值 60% 以上时，<or>该角色攻击力 + 20%</or>',
        '水属性角色生命值 60% 以上时，<hl>该角色攻击力 + 30%</hl>',
      ]
    }
  },
  {
    id: 27,
    content: {
      '队长': [
        '水属性角色生命值 80% 以上时，<or>该角色攻击力 + 140%</or>',
        '水属性角色生命值 80% 以上时，<hl>该角色攻击力 + 160%</hl>',
      ],
      '能力1': [
        '浮游效果期间，<or>自身攻击力 + 50%</or>',
        '浮游效果期间，<hl>自身攻击力 + 60%</hl>',
      ],
      '能力2': [
        '自身生命值 80% 以上时，<or>自身攻击力 + 55%</or>',
        '自身生命值 80% 以上时，<hl>自身攻击力 + 60%</hl>',
      ],
      '能力3': [
        '作为主要角色编成：自身回复生命值时，<or>自身攻击力 + 15%[最大 + 90%]</or>',
        '作为主要角色编成：自身回复生命值时，<hl>自身攻击力 + 25%[最大 + 150%]</hl>',
      ]
    }
  },
  {
    id: 28,
    content: {
      '队长': [
        '<or>强化弹射伤害 + 85%</or> & 强化弹射Lv3所需要的连击数量 - 3',
        '<hl>强化弹射伤害 + 100%</hl> & 强化弹射Lv3所需要的连击数量 - 3',
      ],
    }
  },
  {
    id: 29,
    content: {
      '能力1': [
        '贯穿效果期间，<or>自身攻击力 + 50%</or>',
        '贯穿效果期间，<hl>自身攻击力 + 60%</hl>',
      ],
      '能力2': [
        '浮游效果期间，<or>自身攻击力 + 50%</or>',
        '浮游效果期间，<hl>自身攻击力 + 60%</hl>',
      ],
      '能力3': [
        '作为主要角色编成：15COMBO（连击）以上时，<or>自身攻击力 + 100%</or>',
        '作为主要角色编成：15COMBO（连击）以上时，<hl>自身攻击力 + 150%</hl>',
      ]
    }
  },
  {
    id: 141,
    content: {
      '队长': [
        '<or>水属性角色技能伤害 + 60%</or> & 对中毒效果中的敌人造成的伤害 + 15%（独立伤害乘区2）',
        '<hl>水属性角色技能伤害 + 80%</hl> & 对中毒效果中的敌人造成的伤害 + 15%（独立伤害乘区2）',
      ],
      '能力1': [
        '<or>自身技能伤害 + 50%</or>',
        '<hl>自身技能伤害 + 60%</hl>',
      ],
    }
  },
  {
    id: 197,
    content: {
      '队长': [
        '<or>水属性角色攻击力 + 30%</or>\n强化弹射伤害提升 200% 以上期间，自身攻击力 + 100%',
        '<hl>水属性角色攻击力 + 60%</hl>\n强化弹射伤害提升 200% 以上期间，自身攻击力 + 100%',
      ],
    }
  },
  {
    id: 149,
    content: {
      '队长': [
        '<or>水属性角色攻击力 + 25%</or>\n<or>强化弹射伤害 + 50%</or>',
        '<hl>水属性角色攻击力 + 50%</hl>\n<hl>强化弹射伤害 + 95%</hl>',
      ],
    }
  },
  {
    id: 163,
    content: {
      '队长': [
        '<or>水属性角色直接攻击伤害 + 50%</or> & <or>中毒效果中的敌人造成的直接攻击伤害 + 80%</or>',
        '<hl>水属性角色直接攻击伤害 + 100%</hl> & <hl>中毒效果中的敌人造成的直接攻击伤害 + 130%</hl>',
      ],
    }
  },
  {
    id: 168,
    content: {
      '队长': [
        '<or>强化弹射伤害 + 100%</or>',
        '<hl>强化弹射伤害 + 150%</hl>',
      ],
      '能力2': [
        '5次Power Flip（强化弹射）时，<or>强化弹射伤害 + 10%[最大 + 50%]</or>',
        '5次Power Flip（强化弹射）时，<hl>强化弹射伤害 + 12%[最大 + 60%]</hl>',
      ],
    }
  },
  {
    id: 226,
    content: {
      '队长': [
        '<or>水属性角色攻击力 + 30%</or>\nFever模式时间 + 25%',
        '<hl>水属性角色攻击力 + 80%</hl>\nFever模式时间 + 25%',
      ],
    }
  },
  {
    id: 246,
    content: {
      '队长': [
        '<or>水属性角色攻击力 + 30%</or>\n自身发动技能时，<or>水属性角色直接攻击伤害 + 25%[最大 + 100%]</or>',
        '<hl>水属性角色攻击力 + 60%</hl>\n自身发动技能时，<hl>水属性角色直接攻击伤害 + 50%[最大 + 200%]</hl>',
      ],
      '能力3': [
        '作为主要角色编成：自身获得的攻击提升效果每达到1个，<or>自身攻击力 + 12%[最大 + 60%]</or> & 直接攻击伤害 + 20%[最大 + 100%]',
        '作为主要角色编成：自身获得的攻击提升效果每达到1个，<hl>自身攻击力 + 20%[最大 + 100%]</hl> & 直接攻击伤害 + 20%[最大 + 100%]',
      ],
    }
  },
  {
    id: 275,
    content: {
      '技能': [
        '命令Alter Device进行炮击，<or>对领域内全体敌人造成水属性伤害(12x / 3hit)（不破坏弱点）</or> / 赋予全体队员攻击力提升效果(50% / 20s)',
        '命令Alter Device进行炮击，<hl>对领域内全体敌人造成水属性伤害(15x / 3hit)（不破坏弱点）</hl> / 赋予全体队员攻击力提升效果(50% / 20s)',
      ],
      '队长': [
        '<or>水属性角色攻击力 + 25%</or>\n<or>强化弹射伤害 + 50%</or>',
        '<hl>水属性角色攻击力 + 50%</hl>\n<hl>强化弹射伤害 + 95%</hl>',
      ],
    }
  },
]
const up_data_thunder = [
  {
    id: 9,
    content: {
      '队长': [
        '雷属性角色生命值 + 10% & <or>攻击力 + 20%</or> & <or>技能伤害 + 60%</or>',
        '雷属性角色生命值 + 10% & <hl>攻击力 + 50%</hl> & <hl>技能伤害 + 90%</hl>',
      ],
    }
  },
  {
    id: 134,
    content: {
      '队长': [
        '<or>雷属性角色攻击力 + 40%</or>\nFever模式中，<or>雷属性角色攻击力 + 75%</or>',
        '<hl>雷属性角色攻击力 + 80%</hl>\nFever模式中，<hl>雷属性角色攻击力 + 100%</hl>',
      ],
      '能力1': [
        '自身攻击力 + 20%\nFever模式中，<or>自身攻击力 + 40%</or>',
        '自身攻击力 + 20%\nFever模式中，<hl>自身攻击力 + 60%</hl>',
      ],
    }
  },
  {
    id: 144,
    content: {
      '队长': [
        '<or>雷属性角色攻击力 + 65%</or>',
        '<hl>雷属性角色攻击力 + 70%</hl>\n<hl>强化弹射伤害 + 90%</hl>',
      ],
      '能力1': [
        '<or>自身攻击力 + 20%</or>\n每当达成 10 COMBO（连击）时，自身攻击力 + 1%[最大 + 50%]',
        '<hl>自身攻击力 + 30%</hl>\n每当达成 10 COMBO（连击）时，自身攻击力 + 1%[最大 + 50%]',
      ],
      '能力2': [
        '<or>自身攻击力 + 20%</or>\nPower Flip（强化弹射）时，自身攻击力 + 1%[最大 + 50%]',
        '<hl>自身攻击力 + 30%</hl>\nPower Flip（强化弹射）时，自身攻击力 + 1%[最大 + 50%]',
      ],
    }
  },
  {
    id: 166,
    content: {
      '队长': [
        '<or>雷属性角色攻击力 + 20%</or>\n每当达成 50 COMBO（连击）时，<or>雷属性角色攻击力 + 40%[最大 + 40%]</or>\n每当达成 100 COMBO（连击）时，<or>雷属性角色攻击力 + 60%[最大 + 60%]</or>',
        '<hl>雷属性角色攻击力 + 40%</hl>\n每当达成 50 COMBO（连击）时，<hl>雷属性角色攻击力 + 60%[最大 + 60%]</hl>\n每当达成 100 COMBO（连击）时，<hl>雷属性角色攻击力 + 80%[最大 + 80%]</hl>',
      ],
    }
  },
  {
    id: 170,
    content: {
      '队长': [
        '<or>雷属性角色技能伤害 + 60%</or>\n进入Fever模式时，<or>雷属性角色技能伤害 + 70%[最大 + 140%]</or>',
        '<hl>雷属性角色技能伤害 + 80%</hl>\n进入Fever模式时，<hl>雷属性角色技能伤害 + 100%[最大 + 200%]</hl>',
      ],
    }
  },
  {
    id: 183,
    content: {
      '队长': [
        '雷属性角色生命值 + 20%\n雷属性角色发动技能时，Fever + 70',
        '雷属性角色生命值 + 20% & <hl>攻击力 + 40%</hl>\n雷属性角色发动技能时，Fever + 70',
      ],
    }
  },
  {
    id: 187,
    content: {
      '队长': [
        '自身生命值 50% 以下时，<or>雷属性角色攻击力 + 100%</or> & 水属性抗性 + 20%',
        '自身生命值 50% 以下时，<hl>雷属性角色攻击力 + 120%</hl> & 水属性抗性 + 20%',
      ],
      '能力1': [
        '<or>自身攻击力 + 30%</or>',
        '<hl>自身攻击力 + 60%</hl>',
      ],
    }
  },
  {
    id: 244,
    content: {
      '队长': [
        '战斗开始时，雷属性角色技能槽 + 50% & <or>攻击力 + 30%</or>\n自身生命值 50% 以下时，<or>雷属性角色攻击力 + 40%</or>',
        '战斗开始时，雷属性角色技能槽 + 50% & <hl>攻击力 + 50%</hl>\n自身生命值 50% 以下时，<hl>雷属性角色攻击力 + 80%</hl>',
      ],
    }
  },
  {
    id: 30,
    content: {
      '队长': [
        '<or>雷属性角色技能伤害 + 100%</or>',
        '<hl>雷属性角色技能伤害 + 150%</hl>',
      ],
    }
  },
  {
    id: 31,
    content: {
      '队长': [
        '<or>雷属性角色技能伤害 + 60%</or> & 对麻痹·气绝效果中的敌人造成的伤害 + 15%（独立伤害乘区2）',
        '<hl>雷属性角色技能伤害 + 80%</hl> & 对麻痹·气绝效果中的敌人造成的伤害 + 15%（独立伤害乘区2）',
      ],
      '能力1': [
        '自身发动技能时，（仅1次）自身技能槽 + 50%',
        '自身发动技能时，（仅1次）自身技能槽 + 50%\n<hl>自身攻击力 + 15%</hl>',
      ],
    }
  },
  {
    id: 32,
    content: {
      '技能': [
          '朝距离最近的敌人发射高能量激光炮，<or>对该方向上的敌人造成雷属性伤害(24x / 10hit)</or>',
          '朝距离最近的敌人发射高能量激光炮，<hl>对该方向上的敌人造成雷属性伤害(26x / 10hit)</hl>',
      ],
      '队长': [
        '雷属性角色攻击力 + 30%\nFever模式中，<or>雷属性角色技能伤害 + 150%</or>',
        '雷属性角色攻击力 + 30%\nFever模式中，<hl>雷属性角色技能伤害 + 170%</hl>',
      ],
      '能力1': [
        '自身发动技能时，（仅1次）自身技能槽 + 50%',
        '自身发动技能时，（仅1次）自身技能槽 + 50%\n<hl>自身攻击力 + 15%</hl>',
      ],
    }
  },
  {
    id: 34,
    content: {
      '队长': [
        '<or>雷属性角色攻击力 + 30%</or> & 对种族为“不死”的敌人造成的伤害 + 25%（独立伤害乘区1）',
        '<hl>雷属性角色攻击力 + 40%</hl> & 对种族为“不死”的敌人造成的伤害 + 25%（独立伤害乘区1）',
      ],
    }
  },
  {
    id: 35,
    content: {
      '队长': [
        '自身生命值 50% 以下时，<or>雷属性角色攻击力 + 105%</or>',
        '自身生命值 50% 以下时，<hl>雷属性角色攻击力 + 150%</hl>',
      ],
      '能力2': [
        '自身生命值 50% 以下时，<or>自身攻击力 + 50%</or>',
        '自身生命值 50% 以下时，<hl>自身攻击力 + 65%</hl>',
      ],
      '能力3': [
        '作为主要角色编成：自身生命值 50% 以下时，<or>雷属性角色攻击力 + 100%</or>',
        '作为主要角色编成：自身生命值 50% 以下时，<hl>雷属性角色攻击力 + 150%</hl>',
      ],
    }
  },
  {
    id: 116,
    content: {
      '队长': [
        '<or>雷属性角色攻击力 + 35%</or>\nFever模式时间 + 20%',
        '<hl>雷属性角色攻击力 + 90%</hl>\nFever模式时间 + 20%',
      ],
    }
  },
  {
    id: 129,
    content: {
      '队长': [
        '<or>雷属性角色攻击力 + 20%</or> & 追击伤害 + 25%（独立伤害乘区3）',
        '<hl>雷属性角色攻击力 + 40%</hl> & 追击伤害 + 25%（独立伤害乘区3）',
      ],
    }
  },
  {
    id: 154,
    content: {
      '队长': [
        '<or>雷属性角色攻击力 + 40%</or>\nFever模式中，雷属性角色技能充能速度 + 30%',
        '<hl>雷属性角色攻击力 + 55%</hl>\nFever模式中，雷属性角色技能充能速度 + 30%',
      ],
    }
  },
  {
    id: 176,
    content: {
      '技能': [
        '向自身前方发射巨大的人偶手臂，对命中的敌人造成雷属性伤害(21x / 1hit) + 消除一个强化效果',
        '向自身前方发射巨大的人偶手臂，对命中的敌人造成雷属性伤害(21x / 1hit) + 消除一个强化效果 / <hl>赋予自身攻击力提升(75% / 15s)效果</hl>',
      ],
      '队长': [
        '<or>强化弹射伤害 + 50%</or>\n3次Power Flip（强化弹射）时，<or>雷属性角色技能伤害 + 10%[最大 + 80%]</or>',
        '<hl>强化弹射伤害 + 60%</hl>\n3次Power Flip（强化弹射）时，<hl>雷属性角色技能伤害 + 20%[最大 + 160%]</hl>',
      ],
    }
  },
  {
    id: 184,
    content: {
      '技能': [
        '边抛硬币边挥剑，对自身周围的敌人造成过雷属性伤害(16x / 15hit) + 一定概率(53%)赋予其雷属性抗性降低(25% / 15s)效果 / <or>一定概率(53%)赋予强化弹射伤害提升(30% / 15s)效果</or>',
        '边抛硬币边挥剑，对自身周围的敌人造成过雷属性伤害(16x / 15hit) + 一定概率(53%)赋予其雷属性抗性降低(25% / 15s)效果 / <hl>一定概率(53%)赋予强化弹射伤害提升(77% / 15s)效果</hl>',
      ],
      '队长': [
        '<or>强化弹射伤害 + 33%</or>\n进入Fever模式时，获得<or>15秒</or>雷属性角色技能伤害 + 77%',
        '<hl>强化弹射伤害 + 111%</hl>\n进入Fever模式时，获得<hl>20秒</hl>雷属性角色技能伤害 + 77%',
      ],
    }
  },
  {
    id: 189,
    content: {
      '队长': [
        '<or>雷属性角色攻击力 + 25%</or> & 对麻痹·气绝效果中的敌人造成的伤害 + 20%（独立伤害乘区2）',
        '<hl>雷属性角色攻击力 + 40%</hl> & 对麻痹·气绝效果中的敌人造成的伤害 + 20%（独立伤害乘区2）',
      ],
      '能力3': [
        '作为主要角色编成：战斗开始时，自身收到最大生命值 10% 的伤害 & <or>技能槽 + 40%</or> & <or>攻击力 + 50%</or>',
        '作为主要角色编成：战斗开始时，自身收到最大生命值 10% 的伤害 & <hl>技能槽 + 60%</hl> & <hl>攻击力 + 70%</hl>',
      ],
    }
  },
  {
    id: 212,
    content: {
      '队长': [
        '<or>队伍全体技能伤害 + 80%</or>',
        '<hl>队伍全体技能伤害 + 120%</hl>',
      ],
      '能力3': [
        '作为主要角色编成：自身处于技能伤害提升效果期间，<or>雷属性角色技能伤害 + 50%</or>\n作为主要角色编成：进入Fever模式时，雷属性角色攻击力 + 25%[最大 + 50%]',
        '作为主要角色编成：自身处于技能伤害提升效果期间，<hl>雷属性角色技能伤害 + 60%</hl>\n作为主要角色编成：进入Fever模式时，雷属性角色攻击力 + 25%[最大 + 50%]',
      ],
      '能力4': [
        '战斗开始时，自身技能槽 + 35%',
        '战斗开始时，自身技能槽 + 35% & <hl>棺柩计数 - 2</hl>',
      ]
    }
  },
  {
    id: 215,
    content: {
      '队长': [
        '<or>雷属性角色攻击力 + 30%</or> & 对迟缓效果中的敌人造成的伤害 + 15%（独立伤害乘区2）',
        '<hl>雷属性角色攻击力 + 40%</hl> & 对迟缓效果中的敌人造成的伤害 + 15%（独立伤害乘区2）',
      ],
    }
  },
  {
    id: 241,
    content: {
      '队长': [
        '<or>雷属性角色攻击力 + 40%</or>\n进入Fever模式时，<or>雷属性角色攻击力 + 20%[最大 + 60%]</or>',
        '<hl>雷属性角色攻击力 + 80%</hl>\n进入Fever模式时，<hl>雷属性角色攻击力 + 30%[最大 + 90%]</hl>',
      ],
      '能力3': [
        '作为主要角色编成：进入Fever模式时，<or>自身攻击力 + 60%[最大 + 180%]</or>',
        '作为主要角色编成：进入Fever模式时，<hl>自身攻击力 + 70%[最大 + 210%]</hl>',
      ],
    }
  },
  {
    id: 247,
    content: {
      '队长': [
        '雷属性角色生命值 + 10% & <or>攻击力 + 20%</or> & <or>技能伤害 + 30%</or>',
        '雷属性角色生命值 + 10% & <hl>攻击力 + 40%</hl> & <hl>技能伤害 + 70%</hl>',
      ],
      '能力3': [
        '作为主要角色编成：队长生命值 50% 以下时，雷属性角色水属性抗性 + 15%\n作为主要角色编成：队长生命值 30% 以下时，雷属性角色水属性抗性 + 15%',
        '作为主要角色编成：队长生命值 50% 以下时，雷属性角色水属性抗性 + 15% & <hl>攻击力 + 15%</hl>\n作为主要角色编成：队长生命值 30% 以下时，雷属性角色水属性抗性 + 15% & <hl>攻击力 + 15%</hl>',
      ],
    }
  },
  {
    id: 260,
    content: {
      '队长': [
        '自身生命值 50% 以下时，<or>雷属性角色攻击力 + 40%</or>\n<or>雷属性角色技能伤害 + 50%</or>',
        '自身生命值 50% 以下时，<hl>雷属性角色攻击力 + 80%</hl>\n<hl>雷属性角色技能伤害 + 90%</hl>',
      ],
      '能力3': [
        '作为主要角色编成：自身生命值 50% 以下时，<or>自身技能伤害 + 180%</or>',
        '作为主要角色编成：自身生命值 50% 以下时，<hl>自身技能伤害 + 220%</hl>',
      ],
    }
  },
  {
    id: 270,
    content: {
      '队长': [
        '<or>雷属性角色攻击力 + 50%</or>',
        '<hl>雷属性角色攻击力 + 120%</hl>',
      ],
      '能力1': [
        '<or>自身攻击力 + 40%</or>',
        '<hl>自身攻击力 + 50%</hl>',
      ],
      '能力2': [
        '自身发动技能时，<or>雷属性角色攻击力 + 10%[最大 + 40%]</or>',
        '自身发动技能时，<hl>雷属性角色攻击力 + 12.5%[最大 + 50%]</hl>',
      ],
      '能力3': [
        '作为主要角色编成：自身发动技能时，<or>雷属性角色攻击力 + 20%[最大 + 80%]</or>',
        '作为主要角色编成：自身发动技能时，<hl>雷属性角色攻击力 + 25%[最大 + 100%]</hl>',
      ],
    }
  },
]
const up_data_wind = [
  {
    id: 10,
    content: {
      '队长': [
        '10 COMBO（连击）以上时，<or>风属性角色攻击力 + 60%</or>\n<or>风属性角色攻击力 + 40%</or>',
        '10 COMBO（连击）以上时，<hl>风属性角色攻击力 + 85%</hl>\n<hl>风属性角色攻击力 + 80%</hl>',
      ],
      '能力1': [
        '<or>自身攻击力 + 30%</or>',
        '<hl>自身攻击力 + 55%</hl>',
      ],
    }
  },
  {
    id: 11,
    content: {
      '队长': [
        '风属性角色生命值 60% 以上时，<or>该角色攻击力 + 115%</or>',
        '风属性角色生命值 60% 以上时，<hl>该角色攻击力 + 170%</hl>',
      ],
      '能力1': [
        '<or>风属性角色生命值 + 10%</or>',
        '<hl>风属性角色生命值 + 15%</hl>',
      ],
    }
  },
  {
    id: 12,
    content: {
      '队长': [
        '战斗开始时，风属性角色技能槽 + 50% & <or>攻击力 + 50%</or>',
        '战斗开始时，风属性角色技能槽 + 50% & <hl>攻击力 + 100%</hl>',
      ],
      '能力1': [
        '战斗开始时，<or>获得自身30秒攻击力 + 60%</or>',
        '战斗开始时，<hl>获得自身30秒攻击力 + 75%</hl>',
      ],
    }
  },
  {
    id: 13,
    content: {
      '队长': [
        '<or>风属性角色攻击力 + 40%</or>\n<or>强化弹射伤害 + 40%</or>',
        '<hl>风属性角色攻击力 + 100%</hl>\n<hl>强化弹射伤害 + 70%</hl>',
      ],
      '能力3': [
        '作为主要角色编成：每当自身承受3次伤害时，<or>自身攻击力 + 20%[最大 + 80%]</or>',
        '作为主要角色编成：每当自身承受3次伤害时，<hl>自身攻击力 + 20%[最大 + 160%]</hl>',
      ],
    }
  },
  {
    id: 140,
    content: {
      '队长': [
        '<or>风属性角色攻击力 + 40%</or> & <or>生命值 + 15%</or>',
        '<hl>风属性角色攻击力 + 80%</hl> & <hl>生命值 + 20%</hl>',
      ],
      '能力3': [
        '作为主要角色编成：风属性角色发动技能时，<or>该角色攻击力 + 20%[最大 + 80%]</or>',
        '作为主要角色编成：风属性角色发动技能时，<hl>该角色攻击力 + 25%[最大 + 100%]</hl>',
      ],
    }
  },
  {
    id: 157,
    content: {
      '队长': [
        '<or>风属性角色攻击力 + 40%</or> & <or>技能伤害 + 40%</or>',
        '<hl>风属性角色攻击力 + 80%</hl> & <hl>技能伤害 + 90%</hl>',
      ],
    }
  },
  {
    id: 177,
    content: {
      '队长': [
        '战斗开始时，风属性角色技能槽 + 50% & <or>攻击力 + 50%</or>',
        '战斗开始时，风属性角色技能槽 + 50% & <hl>攻击力 + 100%</hl>',
      ],
    }
  },
  // {
  //   id: 188,
  //   content: {
  //     '能力3': [
  //       '作为主要角色编成：风属性角色发动技能时，<or>该角色攻击力 + 20%[最大 + 80%]</or>',
  //       '作为主要角色编成：风属性角色发动技能时，<hl>该角色攻击力 + 25%[最大 + 100%]</hl>',
  //     ],
  //   }
  // },
  {
    id: 207,
    content: {
      '队长': [
        '<or>风属性角色攻击力 + 40%</or>\n<or>强化弹射伤害 + 40%</or>',
        '<hl>风属性角色攻击力 + 100%</hl>\n<hl>强化弹射伤害 + 70%</hl>',
      ],
      '能力1': [
        '自身发动技能时，获得<or>15秒</or>自身连击效果[直接攻击计算为 2 次 / 合计伤害 + 20%]',
        '自身发动技能时，获得<hl>20秒</hl>自身连击效果[直接攻击计算为 2 次 / 合计伤害 + 20%]',
      ],
      '能力3': [
        '作为主要角色编成：每当队长承受5次伤害时，<or>连击 + 6</or>\n作为主要角色编成：COMBO（连击）达到30时，获得3秒贯穿效果 & 获得3秒浮游效果',
        '作为主要角色编成：每当队长承受5次伤害时，<hl>连击 + 8</hl>\n作为主要角色编成：COMBO（连击）达到30时，获得3秒贯穿效果 & 获得3秒浮游效果',
      ],
      '能力5': [
        '战斗开始时，自身技能槽 + 50%',
        '战斗开始时，自身技能槽 + 50% & <hl>棺柩计数 - 2</hl>',
      ],
    }
  },
  {
    id: 222,
    content: {
      '队长': [
        '<or>风属性角色攻击力 + 40%</or>\n浮游效果期间，<or>风属性角色攻击力 + 60%</or>',
        '<hl>风属性角色攻击力 + 60%</hl>\n浮游效果期间，<hl>风属性角色攻击力 + 120%</hl>',
      ],
    }
  },
  {
    id: 231,
    content: {
      '队长': [
        '风属性角色攻击力 + 50%\n自身的「神速剑技」等级每提升 1 级时，<or>风属性角色攻击力 + 5%[最大 + 100%]</or>',
        '风属性角色攻击力 + 50%\n自身的「神速剑技」等级每提升 1 级时，<hl>风属性角色攻击力 + 8.5%[最大 + 170%]</hl>',
      ],
    }
  },
  {
    id: 245,
    content: {
      '队长': [
        '<or>风属性角色攻击力 + 40%</or>\n每当达成 60 COMBO（连击）时，<or>风属性角色攻击力 + 10%[最大 + 80%]</or>',
        '<hl>风属性角色攻击力 + 60%</hl>\n每当达成 60 COMBO（连击）时，<hl>风属性角色攻击力 + 15%[最大 + 120%]</hl>',
      ],
    }
  },
  {
    id: 253,
    content: {
      '技能': [
        '向近距离最近的敌人突进，对接触到的敌人进行精准连击(5x / 10hit)，对其造成风属性伤害(25x / 1hit)',
        '向近距离最近的敌人突进，对接触到的敌人进行精准连击(5x / 10hit)，对其造成风属性伤害(25x / 1hit) / <hl>赋予自身攻击力提升(50% / 15s)效果</hl>',
      ],
      '队长': [
        '战斗开始时，风属性角色技能槽 + 40% & <or>技能伤害 + 100%</or>',
        '战斗开始时，风属性角色技能槽 + 40% & <hl>技能伤害 + 140%</hl>',
      ],
    }
  },
  {
    id: 272,
    content: {
      '队长': [
        '风属性角色攻击力 + 60%\n队伍中编入 6 名以上风属性角色时，3 次Power Flip（强化弹射）时，<or>风属性角色攻击力 + 12%[最大 + 60%]</or>\n队伍中编入 6 名以上风属性角色时，战斗开始时，获得接下来 5 次弹射为止的连击加成效果[连击 + 9]',
        '风属性角色攻击力 + 60%\n队伍中编入 6 名以上风属性角色时，3 次Power Flip（强化弹射）时，<hl>风属性角色攻击力 + 12.5%[最大 + 100%]</hl>\n队伍中编入 6 名以上风属性角色时，战斗开始时，获得接下来 5 次弹射为止的连击加成效果[连击 + 9]',
      ],
      '能力1': [
        '自身是风属性角色时，3 次Power Flip（强化弹射）时，<or>自身攻击力 + 20%[最大 + 100%]</or>',
        '自身是风属性角色时，3 次Power Flip（强化弹射）时，<hl>自身攻击力 + 20%[最大 + 120%]</hl>',
      ],
      '能力2': [
        '自身是风属性角色时，3 次Power Flip（强化弹射）时，<or>自身攻击力 + 20%[最大 + 100%]</or>',
        '自身是风属性角色时，3 次Power Flip（强化弹射）时，<hl>自身攻击力 + 20%[最大 + 120%]</hl>',
      ],
      '能力3': [
        '作为主要角色编成：10 次Power Flip（强化弹射）时，获得接下来 5 次弹射为止的连击加成效果[连击 + 9]\n作为主要角色编成：3 次Power Flip（强化弹射）时，<or>自身攻击力 + 10%[最大 + 100%]</or>',
        '作为主要角色编成：10 次Power Flip（强化弹射）时，获得接下来 5 次弹射为止的连击加成效果[连击 + 9]\n作为主要角色编成：3 次Power Flip（强化弹射）时，<hl>自身攻击力 + 20%[最大 + 200%]</hl>',
      ],
    }
  },
  {
    id: 2,
    content: {
      '技能': [
        '技能能量：<or>570</or>',
        '技能能量：<hl>530</hl>',
      ],
      '队长': [
        '<or>队伍全体攻击力 + 20%</or>\n<or>强化弹射伤害 + 20%</or>',
        '<hl>队伍全体攻击力 + 60%</hl>\n<hl>强化弹射伤害 + 60%</hl>',
      ],
      '能力1': [
        '<or>自身攻击力 + 25%</or>',
        '<hl>自身攻击力 + 45%</hl>',
      ],
      '能力3': [
        '作为主要角色编成：<or>自身攻击力 + 40%</or>',
        '作为主要角色编成：<hl>自身攻击力 + 125%</hl>',
      ],
    }
  },
  {
    id: 36,
    content: {
      '技能': [
        '向所有方位连续投掷3次飞刀，<or>对命中的敌人造成风属性伤害(9x / 15hit)</or>',
        '向所有方位连续投掷3次飞刀，<hl>对命中的敌人造成风属性伤害(13x / 15hit)</hl>',
      ],
      '队长': [
        '玛纳获得数量提升 5%\n<or>风属性角色攻击力 + 15%</or> & 生命值 + 10%',
        '玛纳获得数量提升 5%\n<hl>风属性角色攻击力 + 70%</hl> & 生命值 + 10%',
      ],
      '能力2': [
        '每当达成 30 COMBO（连击）时，<or>获得12秒队伍全体的攻击力 + 15%</or>',
        '每当达成 30 COMBO（连击）时，<hl>获得12秒队伍全体的攻击力 + 20%</hl>',
      ],
      '能力3': [
        '作为主要角色编成：每当自身直接攻击10次时，<or>风属性角色攻击力 + 6%[最大 + 60%]</or>',
        '作为主要角色编成：每当自身直接攻击10次时，<hl>风属性角色攻击力 + 8%[最大 + 80%]</hl>',
      ],
    }
  },
  {
    id: 37,
    content: {
      '队长': [
        '风属性角色生命值 + 15%\n浮游效果期间，<or>风属性角色攻击力 + 60%</or>',
        '风属性角色生命值 + 15%\n浮游效果期间，<hl>风属性角色攻击力 + 80%</hl>',
      ],
      '能力1': [
        '自身生命值 + 15%',
        '自身生命值 + 15% & <hl>攻击力 + 15%</hl>',
      ],
      // '能力6': [
      //   '',
      //   '',
      // ],
    }
  },
  {
    id: 38,
    content: {
      '队长': [
        '战斗开始时，风属性角色技能槽 + 30% & <or>技能伤害 + 80%</or>',
        '战斗开始时，风属性角色技能槽 + 30% & <hl>技能伤害 + 110%</hl>',
      ],
    }
  },
  {
    id: 39,
    content: {
      '技能': [
        '向最近的敌人连续射出15根受到风之加护的箭矢，<or>对命中的敌人造成风属性伤害(7.5x / 15hit)</or> + 赋予迟缓(15s)效果',
        '向最近的敌人连续射出15根受到风之加护的箭矢，<hl>对命中的敌人造成风属性伤害(15x / 15hit)</hl> + 赋予迟缓(15s)效果',
      ],
      '队长': [
        '风属性角色生命值 + 15%\n每当达成 30 COMBO（连击）时，<or>风属性角色攻击力 + 10%[最大 + 50%]</or>',
        '风属性角色生命值 + 15%\n每当达成 30 COMBO（连击）时，<hl>风属性角色攻击力 + 14%[最大 + 70%]</hl>',
      ],
      '能力1': [
        '自身生命值 + 15%',
        '自身生命值 + 15% & <hl>攻击力 + 15%</hl>',
      ],
      '能力3': [
        '作为主要角色编成：自身生命值 60% 以上时，<or>风属性角色攻击力 + 45%</or>',
        '作为主要角色编成：自身生命值 60% 以上时，<hl>风属性角色攻击力 + 65%</hl>',
      ],
    }
  },
  {
    id: 40,
    content: {
      '技能': [
        '对自身周围进行横扫，并对距离最近的敌人使出强烈的一击，<or>对命中的敌人造成风属性伤害(18x / 9hit)</or> / 解除一个队伍全体的弱体效果',
        '对自身周围进行横扫，并对距离最近的敌人使出强烈的一击，<hl>对命中的敌人造成风属性伤害(22x / 12hit)</hl> / 解除一个队伍全体的弱体效果',
      ],
      '队长': [
        '<or>风属性角色攻击力 + 15%</or> & 雷属性抗性 + 25%',
        '<hl>风属性角色攻击力 + 45%</hl> & 雷属性抗性 + 25%',
      ],
      '能力3': [
        '作为主要角色编成：每当达成 30 COMBO（连击）时，<or>自身攻击力 + 10%[最大 + 50%]</or> & 雷属性抗性 + 5%[最大 + 25%]',
        '作为主要角色编成：每当达成 30 COMBO（连击）时，<hl>自身攻击力 + 14%[最大 + 70%]</hl> & 雷属性抗性 + 5%[最大 + 25%]',
      ],
    }
  },
  {
    id: 111,
    content: {
      '队长': [
        '每当达成 20 COMBO（连击）时，<or>队伍全体攻击力 + 6%[最大 + 60%]</or>',
        '每当达成 20 COMBO（连击）时，<hl>队伍全体攻击力 + 12%[最大 + 120%]</hl>',
      ],
      '能力3': [
        '作为主要角色编成：15 COMBO（连击）以上时，<or>自身攻击力 + 100%</or>',
        '作为主要角色编成：15 COMBO（连击）以上时，<hl>自身攻击力 + 150%</hl>',
      ],
    }
  },
  {
    id: 122,
    content: {
      '技能': [
        '通过抽签试试运气！分别以一定概率(50%)赋予队伍全体<or>攻击力提升(20% / 15s)</or>、<or>强化弹射伤害提升(20% / 15s)</or>、<or>技能伤害提升(40% / 15s)</or>效果 / <or>FEVER槽增加(50)</or>',
        '通过抽签试试运气！分别以一定概率(50%)赋予队伍全体<hl>攻击力提升(50% / 15s)</hl>、<hl>强化弹射伤害提升(50% / 15s)</hl>、<hl>技能伤害提升(50% / 15s)</hl>效果 / <hl>FEVER槽增加(75)</hl>',
      ],
      '队长': [
        '<or>风属性角色攻击力 + 30%</or>\nFever模式时间 + 25%',
        '<hl>风属性角色攻击力 + 80%</hl>\nFever模式时间 + 25%',
      ],
      '能力1': [
        '自身获得攻击提升效果时，<or>队伍全体攻击力 + 5%[最大 + 25%]</or>',
        '自身获得攻击提升效果时，<hl>队伍全体攻击力 + 7%[最大 + 35%]</hl>',
      ],
    }
  },
  {
    id: 136,
    content: {
      '技能': [
        '向前方突进，<or>对自身周围造成风属性伤害(15x / 15hit)</or> + 强化弹射伤害提升(50% / 15s)效果',
        '向前方突进，<hl>对自身周围造成风属性伤害(18x / 15hit)</hl> + 强化弹射伤害提升(50% / 15s)效果',
      ],
    }
  },
  {
    id: 145,
    content: {
      '队长': [
        '<or>风属性角色攻击力 + 20%</or>\n每当达成 30 COMBO（连击）时，<or>风属性角色攻击力 + 10%[最大 + 50%]</or>',
        '<hl>风属性角色攻击力 + 40%</hl>\n每当达成 30 COMBO（连击）时，<hl>风属性角色攻击力 + 20%[最大 + 100%]</hl>',
      ],
      '能力1': [
        '<or>风属性角色技能伤害 + 25%</or>',
        '<hl>风属性角色技能伤害 + 30%</hl>',
      ],
    }
  },
  {
    id: 158,
    content: {
      '队长': [
        '<or>风属性角色技能伤害 + 80%</or>\n20 COMBO（连击）以上时，<or>风属性角色攻击力 + 30%</or>',
        '<hl>风属性角色技能伤害 + 100%</hl>\n20 COMBO（连击）以上时，<hl>风属性角色攻击力 + 55%</hl>',
      ],
    }
  },
  {
    id: 213,
    content: {
      '队长': [
        '<or>风属性角色攻击力 + 30%</or>\n每存在 1 个敌人，<or>风属性角色攻击力 + 10%[最大 + 50%]</or>',
        '<hl>风属性角色攻击力 + 60%</hl>\n每存在 1 个敌人，<hl>风属性角色攻击力 + 16%[最大 + 80%]</hl>',
      ],
    }
  },
  {
    id: 220,
    content: {
      '队长': [
        '<or>风属性角色技能伤害 + 60%</or> & 所受的回复量 + 15%',
        '<hl>风属性角色技能伤害 + 100%</hl> & 所受的回复量 + 15%',
      ],
      '能力3': [
        '作为主要角色编成：自身发动技能时，<or>风属性角色技能伤害 + 20%[最大 + 120%]</or>',
        '作为主要角色编成：自身发动技能时，<hl>风属性角色技能伤害 + 24%[最大 + 120%]</hl>',
      ],
    }
  },
  {
    id: 243,
    content: {
      '队长': [
        '<or>风属性角色攻击力 + 30%</or>\n10 COMBO（连击）以上时，<or>风属性角色攻击力 + 50%</or>',
        '<hl>风属性角色攻击力 + 50%</hl>\n10 COMBO（连击）以上时，<hl>风属性角色攻击力 + 80%</hl>',
      ],
      '能力1': [
        '每当达成 30 COMBO（连击）时，<or>自身攻击力 + 11%[最大 + 55%]</or>',
        '每当达成 30 COMBO（连击）时，<hl>自身攻击力 + 14%[最大 + 70%]</hl>',
      ],
      '能力2': [
        '贯穿效果期间，<or>风属性角色攻击力 + 30%</or>',
        '贯穿效果期间，<hl>风属性角色攻击力 + 35%</hl>',
      ],
      '能力3': [
        '作为主要角色编成：每当达成 50 COMBO（连击）时，<or>自身直接攻击伤害 + 20%[最大 + 160%]</or>',
        '作为主要角色编成：每当达成 50 COMBO（连击）时，<hl>自身直接攻击伤害 + 40%[最大 + 320%]</hl>',
      ],
    }
  },
  {
    id: 250,
    content: {
      '队长': [
        '<or>风属性角色攻击力 + 30%</or>\n<or>强化弹射伤害 + 40%</or>',
        '<hl>风属性角色攻击力 + 60%</hl>\n<hl>强化弹射伤害 + 80%</hl>',
      ],
      // '能力3': [
      //   '作为主要角色编成：',
      //   '作为主要角色编成：',
      // ],
    }
  },
  {
    id: 254,
    content: {
      '技能': [
        '以疾风骤雨般的速度向前方使出踢击，对前方的敌人造成风属性伤害(18x / 15hit) / <or>赋予强化弹射伤害提升效果(50% / 15s)</or>',
        '以疾风骤雨般的速度向前方使出踢击，对前方的敌人造成风属性伤害(18x / 15hit) / <hl>赋予强化弹射伤害提升效果(75% / 15s)</hl>',
      ],
      '能力1': [
        '4 次Power Flip（强化弹射）时，<or>强化弹射伤害 + 5%[最大 + 40%]</or>',
        '4 次Power Flip（强化弹射）时，<hl>强化弹射伤害 + 10%[最大 + 50%]</hl>',
      ],
      // '能力2': [
      //   '',
      //   '',
      // ],
      '能力3': [
        '作为主要角色编成：自身发动技能时，<or>自身攻击力 + 35%[最大 + 140%]</or>',
        '作为主要角色编成：自身发动技能时，<hl>自身攻击力 + 50%[最大 + 200%]</hl>',
      ],
    }
  },
  {
    id: 264,
    content: {
      '队长': [
        '<or>风属性角色攻击力 + 30%</or>\n10 COMBO（连击）以上时，<or>风属性角色直接攻击伤害 + 80%</or>',
        '<hl>风属性角色攻击力 + 50%</hl>\n10 COMBO（连击）以上时，<hl>风属性角色直接攻击伤害 + 120%</hl>',
      ],
      '能力1': [
        '10 次冲刺时，<or>自身直接攻击伤害 + 25%[最大 + 100%]</or>',
        '10 次冲刺时，<hl>自身直接攻击伤害 + 37.5%[最大 + 150%]</hl>',
      ],
      '能力2': [
        '自身发动技能时，<or>自身直接攻击伤害 + 30%[最大 + 120%]</or>',
        '自身发动技能时，<hl>自身直接攻击伤害 + 40%[最大 + 160%]</hl>',
      ],
      '能力3': [
        '作为主要角色编成：加速效果期间，<or>风属性角色攻击力 + 60%</or>',
        '作为主要角色编成：加速效果期间，<hl>风属性角色攻击力 + 80%</hl>',
      ],
    }
  },
]
const up_data_light = [
  {
    id: 14,
    content: {
      '队长': [
          '<or>光属性角色攻击力 + 40%</or>\nFever模式时间 + 30%',
          '<hl>光属性角色攻击力 + 100%</hl>\nFever模式时间 + 30%',
      ]
    }
  },
  {
    id: 15,
    content: {
      '队长': [
        '<or>光属性角色攻击力 + 40%</or>\n光属性角色回复生命值时，<or>该角色攻击力 + 4%[最大 + 40%]</or> & <or>暗属性抗性 + 1.5%[最大 + 15%]</or>',
        '<hl>光属性角色攻击力 + 60%</hl>\n光属性角色回复生命值时，<hl>该角色攻击力 + 6%[最大 + 60%]</hl> & <hl>暗属性抗性 + 2%[最大 + 20%]</hl>',
      ]
    }
  },
  {
    id: 16,
    content: {
      '队长': [
        '光属性角色生命值 60% 以上时，<or>该角色攻击力 + 115%</or>',
        '光属性角色生命值 60% 以上时，<hl>该角色攻击力 + 170%</hl>',
      ],
      '能力2': [
        '自身回复生命值时，<or>自身攻击力 + 10%[最大 + 60%]</or>',
        '自身回复生命值时，<hl>自身攻击力 + 12.5%[最大 + 75%]</hl>',
      ],
      '能力3': [
        '作为主要角色编成：自身生命值 80% 以上时，<or>光属性角色攻击力 + 80%</or>',
        '作为主要角色编成：自身生命值 80% 以上时，<hl>光属性角色攻击力 + 90%</hl>',
      ],
    }
  },
  {
    id: 114,
    content: {
      '技能': [
        '白乃乘坐雪橇分发礼物，回复参战者全员的生命值(10%)【对光属性角色效果提升(50%)】 / <or>FEVER槽增加(42)</or>',
        '<hl>技能的停止时间缩短</hl>\n白乃乘坐雪橇分发礼物，回复参战者全员的生命值(10%)【对光属性角色效果提升(50%)】 / <hl>FEVER槽增加(97)</hl>',
      ],
      '队长': [
        '光属性发动技能时，Fever + 50\n<or>光属性角色攻击力 + 30%</or>',
        '光属性发动技能时，Fever + 50\n<hl>光属性角色攻击力 + 100%</hl>',
      ],
      '能力1': [
        '<or>光属性角色攻击力 + 15%</or>',
        '<hl>光属性角色攻击力 + 30%</hl>',
      ],
    }
  },
  {
    id: 147,
    content: {
      '队长': [
        '<or>光属性角色攻击力 + 40%</or> & <or>直接攻击伤害 + 60%</or>',
        '<hl>光属性角色攻击力 + 60%</hl> & <hl>直接攻击伤害 + 160%</hl>',
      ],
    }
  },
  {
    id: 148,
    content: {
      '队长': [
        '<or>光属性角色攻击力 + 40%</or>\n<or>强化弹射伤害 + 40%</or>',
        '<hl>光属性角色攻击力 + 100%</hl>\n<hl>强化弹射伤害 + 70%</hl>',
      ],
    }
  },
  {
    id: 162,
    content: {
      '队长': [
        '<or>光属性角色攻击力 + 40%</or>\n光属性角色获得的强化效果每达到1个，<or>该角色攻击力 + 6%[最大 + 60%]</or> & <or>技能伤害 + 4%[最大 + 40%]</or>',
        '<hl>光属性角色攻击力 + 60%</hl>\n光属性角色获得的强化效果每达到1个，<hl>该角色攻击力 + 7%[最大 + 70%]</hl> & <hl>技能伤害 + 7%[最大 + 70%]</hl>',
      ],
      '能力3': [
        '作为主要角色编成：自身获得的强化效果每达到1个，<or>自身技能伤害 + 15%[最大 + 240%]</or>',
        '作为主要角色编成：自身获得的强化效果每达到1个，<hl>自身技能伤害 + 25%[最大 + 300%]</hl>',
      ],
    }
  },
  {
    id: 171,
    content: {
      '队长': [
        'Fever模式中，<or>光属性角色攻击力 + 120%</or>\nFever模式时间 + 30%',
        'Fever模式中，<hl>光属性角色攻击力 + 130%</hl>\nFever模式时间 + 30%',
      ],
    }
  },
  {
    id: 192,
    content: {
      '技能': [
        '向领域内所有人演奏优雅的旋律，以一定的时间差攻击全体敌人，<or>对其造成光属性伤害(16x / 8hit)（不破坏弱点）</or> / <or>赋予光属性角色攻击力提升(50% / 15s)效果</or> / 赋予自身连击(25% / 12s)效果',
        '向领域内所有人演奏优雅的旋律，以一定的时间差攻击全体敌人，<hl>对其造成光属性伤害(16x / 12hit)（不破坏弱点）</hl> / <hl>赋予光属性角色攻击力提升(100% / 15s)效果</hl> / 赋予自身连击(25% / 12s)效果',
      ],
      '队长': [
        '<or>光属性角色攻击力 + 50%</or>\n队伍中编入 1 名以上光属性角色时，<or>自身攻击力 + 10%[最大 + 60%]</or>',
        '<hl>光属性角色攻击力 + 80%</hl>\n队伍中编入 1 名以上光属性角色时，<hl>自身攻击力 + 15%[最大 + 90%]</hl>',
      ],
      '能力2': [
        '每当自身直接攻击20次时，<or>光属性角色攻击力 + 5%[最大 + 50%]</or>',
        '每当自身直接攻击20次时，<hl>光属性角色攻击力 + 10%[最大 + 50%]</hl>',
      ],
      '能力3': [
        '作为主要角色编成：3 次发动强化弹射Lv1时，连击 + 10\n作为主要角色编成：发动强化弹射Lv2时，<or>强化弹射伤害 + 5%[最大 + 50%]</or>',
        '作为主要角色编成：3 次发动强化弹射Lv1时，连击 + 10\n作为主要角色编成：发动强化弹射Lv2时，<hl>强化弹射伤害 + 7%[最大 + 70%]</hl>',
      ],
    }
  },
  {
    id: 202,
    content: {
      '队长': [
        '<or>光属性角色技能伤害 + 125%</or>',
        '<hl>光属性角色技能伤害 + 200%</hl>',
      ],
    }
  },
  {
    id: 203,
    content: {
      '队长': [
        '<or>光属性角色生命值 + 15%</or>\n自身拥有护盾期间，<or>光属性角色攻击力 + 80%</or>',
        '<hl>光属性角色生命值 + 20%</hl>\n自身拥有护盾期间，<hl>光属性角色攻击力 + 100%</hl>',
      ],
    }
  },
  {
    id: 210,
    content: {
      '队长': [
          '<or>队伍全体攻击力 + 60%</or>',
          '<hl>队伍全体攻击力 + 125%</hl>',
      ],
      '能力4': [
          '战斗开始时，自身技能槽 + 50%',
          '战斗开始时，自身技能槽 + 50% & <hl>棺柩计数 - 2</hl>',
      ],
      '能力6': [
          '自身发动技能时，<or>光属性角色攻击力 + 6%[最大 + 30%]</or>',
          '自身发动技能时，<hl>光属性角色攻击力 + 7.5%[最大 + 30%]</hl>',
      ]
    }
  },
  {
    id: 232,
    content: {
      '队长': [
        '<or>光属性角色攻击力 + 50%</or>\n光属性角色获得的强化效果每达到1个，<or>该角色攻击力 + 6%[最大 + 30%]</or> & <or>能力伤害 + 4%[最大 + 20%]</or>',
        '<hl>光属性角色攻击力 + 80%</hl>\n光属性角色获得的强化效果每达到1个，<hl>该角色攻击力 + 8%[最大 + 40%]</hl> & <hl>能力伤害 + 6%[最大 + 30%]</hl>',
      ],
    }
  },
  {
    id: 256,
    content: {
      '队长': [
        '<or>光属性角色攻击力 + 60%</or>\n光属性角色发动技能时，该角色攻击力 + 6%[最大 + 30%] & <or>能力伤害 + 4%[最大 + 20%]</or>',
        '<hl>光属性角色攻击力 + 90%</hl>\n光属性角色发动技能时，该角色攻击力 + 6%[最大 + 30%] & <hl>能力伤害 + 6%[最大 + 30%]</hl>',
      ],
    }
  },
  {
    id: 268,
    content: {
      '技能': [
        '释放结晶化手臂中封存的能量，<or>对自身前方的敌人造成光属性伤害(15x / 5hit)</or> / 赋予自身攻击力提升(50% / 20s) + <or>能力伤害提升(25% / 20s)</or>效果',
        '释放结晶化手臂中封存的能量，<hl>对自身前方的敌人造成光属性伤害(15x / 6hit)</hl> / 赋予自身攻击力提升(50% / 20s) + <hl>能力伤害提升(50% / 20s)</hl>效果',
      ],
      '队长': [
        '<or>光属性角色攻击力 + 50%</or>\n光属性角色发动能力攻击时，<or>该角色攻击力 + 2%[最大 + 20%]</or> & <or>能力伤害 + 2%[最大 + 20%]</or>',
        '<hl>光属性角色攻击力 + 80%</hl>\n光属性角色发动能力攻击时，<hl>该角色攻击力 + 3%[最大 + 30%]</hl> & <hl>能力伤害 + 3%[最大 + 30%]</hl>',
      ],
    }
  },
  {
    id: 41,
    content: {
      '技能': [
          '以充满爱的歌声赋予参战者全员攻击力提升(75% / 20s)效果 / <or>FEVER槽增加(45)</or>',
          '以充满爱的歌声赋予参战者全员攻击力提升(75% / 20s)效果 / <hl>FEVER槽增加(75)</hl>',
      ],
      '队长': [
        '<or>光属性角色攻击力 + 20%</or>\nFever模式中，光属性角色攻击力 + 100%',
        '<hl>光属性角色攻击力 + 40%</hl>\nFever模式中，光属性角色攻击力 + 100%',
      ],
      '能力3': [
        '作为主要角色编成：进入Fever模式时，获得5秒赋予光属性角色再生效果[效果 恢复180]',
        '作为主要角色编成：进入Fever模式时，获得5秒赋予光属性角色再生效果[效果 恢复180]\n作为主要角色编成：<hl>Fever模式中，光属性角色攻击力 + 30%</hl>',
      ],
    }
  },
  {
    id: 42,
    content: {
      '队长': [
        '光属性角色生命值 + 20% & 暗属性抗性 + 15%',
        '光属性角色生命值 + 20% & 暗属性抗性 + 15% & <hl>攻击力 + 20%</hl>',
      ],
    }
  },
  {
    id: 43,
    content: {
      '队长': [
        '<or>光属性角色技能伤害 + 100%</or>',
        '<hl>光属性角色技能伤害 + 150%</hl>',
      ],
    }
  },
  {
    id: 44,
    content: {
      '技能': [
          '向自身正前方投掷光剑，<or>对命中的敌人造成光属性伤害(12x / 3hit)</or> / 赋予队伍全体再生(75 / 8s)效果 / 赋予参战者全员攻击力提升(50% / 15s)效果',
          '向自身正前方投掷光剑，<hl>对命中的敌人造成光属性伤害(18x / 3hit)</hl> / 赋予队伍全体再生(75 / 8s)效果 / 赋予参战者全员攻击力提升(50% / 15s)效果',
      ],
      '能力1': [
          '自身生命值 60% 以上时，<or>自身攻击力 + 40%</or>',
          '自身生命值 60% 以上时，<hl>自身攻击力 + 55%</hl>',
      ],
      '能力3': [
          '作为主要角色编成：自身生命值 60% 以上时，<or>光属性角色攻击力 + 45%</or>',
          '作为主要角色编成：自身生命值 60% 以上时，<hl>光属性角色攻击力 + 65%</hl>',
      ]
    }
  },
  {
    id: 45,
    content: {
      '队长': [
          '<or>光属性角色攻击力 + 50%</or>',
          '<hl>光属性角色攻击力 + 120%</hl>',
      ],
      '能力1': [
        '<or>自身攻击力 + 25%</or>',
        '<hl>自身攻击力 + 45%</hl>',
      ],
      '能力3': [
        '作为主要角色编成：自身处于攻击提升效果期间，<or>自身攻击力 + 70%</or>\n作为主要角色编成：自身处于再生效果期间，<or>自身技能伤害 + 70%</or>',
        '作为主要角色编成：自身处于攻击提升效果期间，<hl>自身攻击力 + 85%</hl>\n作为主要角色编成：自身处于再生效果期间，<hl>自身技能伤害 + 85%</hl>',
      ]
    }
  },
  {
    id: 138,
    content: {
      '技能': [
        '面向最近的敌方，用菜刀碎斩，<or>对周围的敌方造成光属性伤害(12x / 9hit)【对种族「魔」「兽」的伤害提升(50%)】</or> / 最后1击如果击中敌方，可以回复自身的生命值(10%)【对光属性角色效果提升(50%)】\n技能能量：<or>500</or>',
        '面向最近的敌方，用菜刀碎斩，<hl>对周围的敌方造成光属性伤害(15x / 9hit)【对种族「魔」「兽」的伤害提升(50%)】</hl> / 最后1击如果击中敌方，可以回复自身的生命值(10%)【对光属性角色效果提升(50%)】\n技能能量：<hl>470</hl>',
      ],
      '队长': [
        '光属性角色生命值 80% 以上时，<or>该角色攻击力 + 40%</or>\n每击败5个敌人时，光属性角色攻击力 + 6%[最大 + 30%] & （上限 5 次）回复最大生命值的4%',
        '光属性角色生命值 80% 以上时，<hl>该角色攻击力 + 60%</hl>\n每击败5个敌人时，光属性角色攻击力 + 6%[最大 + 30%] & （上限 5 次）回复最大生命值的4%',
      ],
      '能力2': [
        '<or>每击败5个敌人时，除自身外的角色攻击力 + 6%[最大 + 30%]</or>',
        '<hl>每击败3个敌人时，除自身外的角色攻击力 + 7%[最大 + 35%]</hl>',
      ],
    }
  },
  {
    id: 146,
    content: {
      '队长': [
        '<or>光属性角色攻击力 + 30%</or>\nFever模式时间 + 25%',
        '<hl>光属性角色攻击力 + 80%</hl>\nFever模式时间 + 25%',
      ],
    }
  },
  {
    id: 150,
    content: {
      '队长': [
        '<or>光属性角色攻击力 + 30%</or>\n<or>强化弹射伤害 + 40%</or>',
        '<hl>光属性角色攻击力 + 60%</hl>\n<hl>强化弹射伤害 + 80%</hl>',
      ],
    }
  },
  {
    id: 155,
    content: {
      '队长': [
        '<or>光属性角色攻击力 + 30%</or>\n协力球生命值 + 20%',
        '<hl>光属性角色攻击力 + 80%</hl>\n协力球生命值 + 20%',
      ],
      '能力3': [
        '作为主要角色编成：自身生命值 80% 以上时，<or>光属性角色攻击力 + 60%</or>',
        '作为主要角色编成：自身生命值 80% 以上时，<hl>光属性角色攻击力 + 80%</hl>',
      ],
    }
  },
  {
    id: 159,
    content: {
      '队长': [
        '<or>光属性角色攻击力 + 15%</or> & <or>技能伤害 + 70%</or>',
        '<hl>光属性角色攻击力 + 30%</hl> & <hl>技能伤害 + 110%</hl>',
      ],
    }
  },
  {
    id: 185,
    content: {
      '技能': [
        '以神圣魔法赋予全体队员屏障(8%) / 回复参战者全员的生命值(4%)【对光属性角色效果提升(50%)】\n技能能量：<or>600</or>',
        '以神圣魔法赋予全体队员屏障(8%) / 回复参战者全员的生命值(4%)【对光属性角色效果提升(50%)】 + <hl>赋予攻击力提升(50% / 15s)效果</hl>\n技能能量：<hl>570</hl>',
      ],
      '队长': [
        '<or>光属性角色攻击力 + 30%</or>\n光属性角色拥有护盾期间，<or>该角色攻击力 + 60%</or>',
        '<hl>光属性角色攻击力 + 60%</hl>\n光属性角色拥有护盾期间，<hl>该角色攻击力 + 80%</hl>',
      ],
      '能力1': [
        '光属性角色生命值 80% 以上时，<or>该角色攻击力 + 30%</or>',
        '光属性角色生命值 80% 以上时，<hl>该角色攻击力 + 35%</hl>',
      ],
    }
  },
  {
    id: 190,
    content: {
      '队长': [
        '<or>光属性角色技能伤害 + 40%</or> & 暗属性抗性 + 20%',
        '<hl>光属性角色技能伤害 + 65%</hl> & 暗属性抗性 + 20%',
      ],
      '能力3': [
        '作为主要角色编成：<or>除自身外的角色技能伤害 + 35%</or> & 光属性角色生命值 + 10%',
        '作为主要角色编成：<hl>除自身外的角色技能伤害 + 50%</hl> & 光属性角色生命值 + 10%',
      ]
    }
  },
  {
    id: 224,
    content: {
      '队长': [
        '<or>队伍全体攻击力 + 50%</or> & 能力伤害 + 20%',
        '<hl>队伍全体攻击力 + 60%</hl> & 能力伤害 + 20%',
      ],
    }
  },
  {
    id: 227,
    content: {
      '技能': [
        '一段时间内对碰撞到的敌人进行手术，对其造成光属性伤害(12x / 6hit) / 恢复参战者全员的生命值(8%)【对光属性角色效果提升(50%)】 / <or>赋予全体队员再生(200 / 4s)效果</or>',
        '一段时间内对碰撞到的敌人进行手术，对其造成光属性伤害(12x / 6hit) / 恢复参战者全员的生命值(8%)【对光属性角色效果提升(50%)】 / <hl>赋予全体队员再生(200 / 6s)效果</hl>',
      ],
      '队长': [
        '光属性角色所受的回复量 + 15%\n光属性角色回复生命值时，<or>该角色攻击力 + 5%[最大 + 50%]</or>',
        '光属性角色所受的回复量 + 15%\n光属性角色回复生命值时，<hl>该角色攻击力 + 5%[最大 + 50%]</hl>',
      ],
      '能力1': [
        '自身回复生命值时，<or>自身攻击力 + 5%[最大 + 50%]</or>',
        '自身回复生命值时，<hl>自身攻击力 + 7%[最大 + 70%]</hl>',
      ],
      '能力3': [
        '作为主要角色编成：Fever模式中，光属性角色所受的回复量 + 10% & <or>直接攻击伤害 + 60%</or>',
        '作为主要角色编成：Fever模式中，光属性角色所受的回复量 + 10% & <hl>直接攻击伤害 + 90%</hl>',
      ],
    }
  },
  {
    id: 233,
    content: {
      '队长': [
        '<or>光属性角色攻击力 + 30%</or>\n光属性角色拥有护盾期间，该角色全属性抗性 + 30%',
        '<hl>光属性角色攻击力 + 50%</hl>\n光属性角色拥有护盾期间，该角色全属性抗性 + 30%',
      ],
    }
  },
  {
    id: 255,
    content: {
      '技能': [
        '向前方突进，对接触到的敌人放出绝招，对其造成光属性伤害(15x / 1hit) / 以炫目的光芒对自身周围的敌人造成光属性伤害(1x / 19hit) / <or>赋予强化弹射伤害提升(50% / 15s)效果</or>',
        '向前方突进，对接触到的敌人放出绝招，对其造成光属性伤害(15x / 1hit) / 以炫目的光芒对自身周围的敌人造成光属性伤害(1x / 19hit) / <hl>赋予强化弹射伤害提升(75% / 15s)效果</hl>',
      ],
      '队长': [
        '<or>光属性角色攻击力 + 30%</or>\n<or>强化弹射伤害 + 40%</or>',
        '<hl>光属性角色攻击力 + 60%</hl>\n<hl>强化弹射伤害 + 80%</hl>',
      ],
      '能力1': [
        '<or>自身攻击力 + 40%</or>',
        '<hl>自身攻击力 + 50%</hl>',
      ],
      '能力3': [
        '作为主要角色编成：自身的剩余生命值越多，自身攻击力提升【<or>生命值从0%每增加1%，攻击力 + 1.3%[最大 + 130%]</or>】',
        '作为主要角色编成：自身的剩余生命值越多，自身攻击力提升【<hl>生命值从0%每增加1%，攻击力 + 1.7%[最大 + 170%]</hl>】',
      ],
    }
  },
  {
    id: 257,
    content: {
      '队长': [
        '<or>光属性角色攻击力 + 40%</or> & 能力伤害 + 30%',
        '<hl>光属性角色攻击力 + 60%</hl> & 能力伤害 + 30%',
      ],
      '能力3': [
        '作为主要角色编成：当敌人数量不低于 3 个时，<or>光属性角色攻击力 + 50%</or>',
        '作为主要角色编成：当敌人数量不低于 3 个时，<hl>光属性角色攻击力 + 70%</hl>',
      ],
    }
  },
]
const up_data_dark = [
  {
    id: 17,
    content: {
      '队长': [
        '暗属性角色生命值 50% 以下时，<or>该角色攻击力 + 140%</or>',
        '暗属性角色生命值 50% 以下时，<hl>该角色攻击力 + 200%</hl>',
      ],
      '能力1': [
        '<or>自身攻击力 + 30%</or>',
        '<hl>自身攻击力 + 55%</hl>',
      ],
      '能力2': [
        '队伍角色生命值 50% 以下时，<or>该角色攻击力 + 30%</or>',
        '队伍角色生命值 50% 以下时，<hl>该角色攻击力 + 40%</hl>',
      ],
    }
  },
  {
    id: 18,
    content: {
      '队长': [
        '<or>暗属性角色攻击力 + 65%</or>',
        '<hl>暗属性角色攻击力 + 150%</hl>',
      ],
      '能力1': [
        '<or>自身攻击力 + 30%</or>',
        '<hl>自身攻击力 + 55%</hl>',
      ],
    }
  },
  {
    id: 153,
    content: {
      '队长': [
        '<or>暗属性角色攻击力 + 40%</or> & <or>直接攻击伤害 + 60%</or>',
        '<hl>暗属性角色攻击力 + 60%</hl> & <hl>直接攻击伤害 + 160%</hl>',
      ],
      '能力1': [
        '自身发动技能时，<or>自身攻击力 + 10%[最大 + 50%]</or>\n战斗开始时，自身技能槽 + 50%',
        '自身发动技能时，<hl>自身攻击力 + 12%[最大 + 60%]</hl>\n战斗开始时，自身技能槽 + 50%',
      ],
      '能力3': [
        '作为主要角色编成：贯穿效果期间，<or>暗属性角色直接攻击伤害 + 120%</or>',
        '作为主要角色编成：贯穿效果期间，<hl>暗属性角色直接攻击伤害 + 140%</hl>',
      ],
    }
  },
  {
    id: 172,
    content: {
      '队长': [
        '<or>暗属性角色攻击力 + 40%</or>\n贯穿效果期间，<or>暗属性角色攻击力 + 80%</or>',
        '<hl>暗属性角色攻击力 + 60%</hl>\n贯穿效果期间，<hl>暗属性角色攻击力 + 120%</hl>',
      ],
    }
  },
  {
    id: 179,
    content: {
      '队长': [
        '<or>暗属性角色技能伤害 + 70%</or>\n每击败2个敌人时，<or>暗属性角色技能伤害 + 8%[最大 + 120%]</or>',
        '<hl>暗属性角色技能伤害 + 100%</hl>\n每击败2个敌人时，<hl>暗属性角色技能伤害 + 10%[最大 + 150%]</hl>',
      ],
      '能力3': [
        '作为主要角色编成：<or>自身的技能伤害提升到 500% 以上时，</or>自身技能伤害 + 200%',
        '作为主要角色编成：自身技能伤害 + 200%',
      ],
    }
  },
  {
    id: 211,
    content: {
      '队长': [
        '<or>队伍全体技能伤害 + 50%</or>\n队伍角色发动技能时，<or>该角色技能伤害 + 30%[最大 + 90%]</or>',
        '<hl>队伍全体技能伤害 + 80%</hl>\n队伍角色发动技能时，<hl>该角色技能伤害 + 40%[最大 + 120%]</hl>',
      ],
      '能力3': [
        '作为主要角色编成：每击败5个敌人时，<or>暗属性角色技能伤害 + 10%[最大 + 150%]</or>',
        '作为主要角色编成：每击败5个敌人时，<hl>暗属性角色技能伤害 + 12.5%[最大 + 150%]</hl>',
      ],
      '能力4': [
        '自身的棺柩计数 - 2\n<or>队伍全体技能伤害 + 15%</or>',
        '自身的棺柩计数 - 2\n<hl>队伍全体技能伤害 + 20%</hl>',
      ],
    }
  },
  {
    id: 214,
    content: {
      '技能': [
        '用歌的力量<or>赋予队伍全员攻击力提升(75% / 15s)</or> + 直接攻击伤害提升(75% / 15s)效果 / 赋予暗属性角色屏障(6%)',
        '用歌的力量赋予队伍全员直接攻击伤害提升(75% / 15s)效果 / 赋予暗属性角色屏障(6%) / <hl>赋予参战者全员攻击力提升(75% / 15s)效果</hl>',
      ],
      '队长': [
        '<or>暗属性角色攻击力 + 40%</or>\n队伍角色获得的强化效果每达到1个，<or>该角色攻击力 + 20%[最大 + 100%]</or>',
        '<hl>暗属性角色攻击力 + 60%</hl>\n队伍角色获得的强化效果每达到1个，<hl>该角色攻击力 + 24%[最大 + 120%]</hl>',
      ],
      '能力2': [
        '战斗开始时，自身技能槽 + 50%\n队伍角色获得的强化效果每达到1个，<or>该角色直接攻击伤害 + 6%[最大 + 30%]</or>',
        '战斗开始时，自身技能槽 + 50%\n队伍角色获得的强化效果每达到1个，<hl>该角色直接攻击伤害 + 12%[最大 + 60%]</hl>',
      ],
      '能力3': [
        '作为主要角色编成：进入Fever模式时，<or>获得15秒自身的直接攻击伤害 + 30%</or> & 获得15秒连击效果[直接攻击计算为 3 次 / 合计伤害 + 30%]',
        '作为主要角色编成：进入Fever模式时，<hl>获得15秒自身的直接攻击伤害 + 100%</hl> & 获得15秒连击效果[直接攻击计算为 3 次 / 合计伤害 + 30%]',
      ],
    }
  },
  {
    id: 223,
    content: {
      '技能': [
        '放出诅咒波动，<or>对前后的敌人造成暗属性伤害(22.5x / 1hit)</or> + 赋予其攻击力降低(30% / 15s)效果 / 赋予队伍全员回复无效(15s)效果【无法被消除】',
        '放出诅咒波动，<hl>对前后的敌人造成暗属性伤害(26x / 1hit)</hl> + 赋予其攻击力降低(30% / 15s)效果 / 赋予队伍全员回复无效(15s)效果【无法被消除】',
      ],
      '队长': [
        '队伍全体角色生命值 80% 以下时，<or>暗属性角色攻击力 + 80%</or>\n队伍全体角色生命值 50% 以下时，<or>暗属性角色攻击力 + 60%</or>',
        '队伍全体角色生命值 80% 以下时，<hl>暗属性角色攻击力 + 100%</hl>\n队伍全体角色生命值 50% 以下时，<hl>暗属性角色攻击力 + 120%</hl>',
      ],
      '能力3': [
        '作为主要角色编成：队伍全体角色生命值 80% 以下时，<or>自身攻击力 + 50%</or>\n作为主要角色编成：队伍全体角色生命值 50% 以下时，<or>自身攻击力 + 150%</or>',
        '作为主要角色编成：队伍全体角色生命值 80% 以下时，<hl>自身攻击力 + 75%</hl>\n作为主要角色编成：队伍全体角色生命值 50% 以下时，<hl>自身攻击力 + 175%</hl>',
      ],
    }
  },
  {
    id: 229,
    content: {
      '技能': [
        '向距离最近的敌人冲刺，以诅咒之刃发动多重斩击，对行进方向上的敌人造成暗属性伤害(15x / 22hit) / 赋予己方贯穿效果(12s)',
        '向距离最近的敌人冲刺，以诅咒之刃发动多重斩击，对行进方向上的敌人造成暗属性伤害(15x / 22hit) / 赋予己方贯穿效果(12s) / <hl>赋予暗属性角色攻击力提升(50% / 15s)效果</hl>',
      ],
      '队长': [
        '<or>暗属性角色攻击力 + 40%</or>\n<or>强化弹射伤害 + 40%</or>',
        '<hl>暗属性角色攻击力 + 100%</hl>\n<hl>强化弹射伤害 + 70%</hl>',
      ],
      '能力3': [
        '作为主要角色编成：队长为暗属性角色时，2 次Power Flip（强化弹射）时，<or>强化弹射伤害 + 5%[最大 + 150%]</or>',
        '作为主要角色编成：队长为暗属性角色时，2 次Power Flip（强化弹射）时，<hl>强化弹射伤害 + 7.5%[最大 + 150%]</hl>',
      ],
    }
  },
  {
    id: 239,
    content: {
      '队长': [
          '暗属性角色的剩余生命值越少，该角色攻击力提升【<or>生命值从100%每减少1%，攻击力 + 2%[最大 + 160%]</or>】',
          '暗属性角色的剩余生命值越少，该角色攻击力提升【<hl>生命值从100%每减少1%，攻击力 + 2.4%[最大 + 240%]</hl>】'
      ],
      '能力2': [
        '自身生命值 50% 以下时，<or>自身攻击力 + 70%</or>',
        '自身生命值 50% 以下时，<hl>自身攻击力 + 85%</hl>',
      ],
      '能力3': [
        '作为主要角色编成：自身的剩余生命值越少，暗属性角色攻击力提升【<or>生命值从100%每减少1%，攻击力 + 1.25%[最大 + 100%]</or>】',
        '作为主要角色编成：自身的剩余生命值越少，暗属性角色攻击力提升【<hl>生命值从100%每减少1%，攻击力 + 1.25%[最大 + 125%]</hl>】'
      ],
    }
  },
  {
    id: 263,
    content: {
      '技能': [
        '【珂艾特的使魔不在场时】召唤拥有“恢复无效效果”的使魔(150s)，对碰撞到的敌人造成暗属性伤害\n【珂艾特的使魔在场时】驱使使魔发出咆哮，<or>对领域内所有敌人造成暗属性伤害(28x / 1hit)</or>',
        '【珂艾特的使魔不在场时】召唤拥有“恢复无效效果”的使魔(150s)，对碰撞到的敌人造成暗属性伤害\n【珂艾特的使魔在场时】驱使使魔发出咆哮，<hl>对领域内所有敌人造成暗属性伤害(30x / 1hit)</hl>',
      ],
      '队长': [
        '<or>协力球越多，暗属性角色攻击力提升【协力球在 1 个以上时、攻击力 + 25%、2 个以上时、 + 25%、3 个以上时、 + 25%[合计最大 + 75%]】</or>\n协力球攻击力 + 20%',
        '<hl>协力球每达到 1 个，暗属性角色攻击力 + 50%[最大 + 150%]</hl>\n协力球攻击力 + 20%',
      ],
      '能力1': [
        '战斗开始时，自身技能槽 + 50% & 协力球生命值 + 10% & <or>攻击力 + 10%</or>',
        '战斗开始时，自身技能槽 + 50% & 协力球生命值 + 10% & <hl>攻击力 + 20%</hl>',
      ],
      '能力2': [
        '自身发动技能时，<or>暗属性角色攻击力 + 15%[最大 + 60%]</or>',
        '自身发动技能时，<hl>暗属性角色攻击力 + 17.5%[最大 + 70%]</hl>',
      ],
    }
  },
  {
    id: 269,
    content: {
      '队长': [
        '<or>暗属性角色生命值 + 15%</or> & <or>技能伤害 + 60%</or>',
        '<hl>暗属性角色生命值 + 20%</hl> & <hl>技能伤害 + 100%</hl>',
      ],
      '能力3': [
        '作为主要角色编成：战斗开始时，暗属性角色技能槽 + 50%\n作为主要角色编成：每经过 10 秒时，<or>暗属性角色技能伤害 + 4%[最大 + 80%]</or>',
        '作为主要角色编成：战斗开始时，暗属性角色技能槽 + 50%\n作为主要角色编成：每经过 10 秒时，<hl>暗属性角色技能伤害 + 5%[最大 + 80%]</hl>',
      ],
    }
  },
  {
    id: 47,
    content: {
      '队长': [
        '<or>暗属性角色技能伤害 + 60%</or> & 对弱体效果中的敌人造成的伤害 + 10%（独立伤害乘区2）',
        '<hl>暗属性角色技能伤害 + 70%</hl> & 对弱体效果中的敌人造成的伤害 + 10%（独立伤害乘区2）',
      ],
    }
  },
  {
    id: 48,
    content: {
      '队长': [
        '暗属性角色生命值 + 20% & <or>攻击力 + 20%</or>',
        '暗属性角色生命值 + 20% & <hl>攻击力 + 45%</hl>',
      ],
    }
  },
  {
    id: 49,
    content: {
      '队长': [
        '<or>暗属性角色攻击力 + 50%</or>',
        '<hl>暗属性角色攻击力 + 120%</hl>',
      ],
      '能力3': [
        '作为主要角色编成：自身发动技能时，<or>获得5秒贯穿效果</or>',
        '作为主要角色编成：自身发动技能时，<hl>获得10秒贯穿效果</hl>',
      ],
    }
  },
  {
    id: 123,
    content: {
      '技能': [
        '为庆祝新年展示剑法，对自身正面的敌方造成暗属性伤害(15x / 9hit) + 赋予毒效果(20s)',
        '为庆祝新年展示剑法，对自身正面的敌方造成暗属性伤害(15x / 9hit) + 赋予毒效果(20s) / <hl>赋予全体队员攻击力提升(50% / 15s)效果</hl>',
      ],
      '能力1': [
        '自身生命值 50% 以下时，<or>队伍全体攻击力 + 20%</or>',
        '自身生命值 50% 以下时，<hl>队伍全体攻击力 + 30%</hl>',
      ],
      '能力2': [
        '自身处于攻击提升效果期间，<or>队伍全体攻击力 + 20%</or>',
        '自身处于攻击提升效果期间，<hl>队伍全体攻击力 + 30%</hl>',
      ],
    }
  },
  {
    id: 126,
    content: {
      '技能': [
        '挥舞双剑，从纵横两个方向无数次发动沉重的斩击，<or>对自身周围的敌方造成暗属性伤害(18x / 4hit)</or>',
        '挥舞双剑，从纵横两个方向无数次发动沉重的斩击，<hl>对自身周围的敌方造成暗属性伤害(22x / 4hit)</hl>',
      ],
      '队长': [
          '<or>暗属性角色攻击力 + 30%</or>\n暗属性角色发动技能时，<or>暗属性角色攻击力 + 5%[最大 + 50%]</or>',
          '<hl>暗属性角色攻击力 + 60%</hl>\n暗属性角色发动技能时，<hl>暗属性角色攻击力 + 10%[最大 + 100%]</hl>',
      ],
      '能力1': [
          '<or>自身攻击力 + 25%</or>',
          '<hl>自身攻击力 + 45%</hl>',
      ],
      '能力2': [
          '自身发动技能时，<or>暗属性角色攻击力 + 7%[最大 + 35%]</or>',
          '自身发动技能时，<hl>暗属性角色攻击力 + 9%[最大 + 45%]</hl>',
      ],
      '能力3': [
        '作为主要角色编成：战斗开始时，暗属性角色技能槽 + 50%\n作为主要角色编成：暗属性角色发动技能时，<or>自身技能伤害 + 8%[最大 + 120%]</or>',
        '作为主要角色编成：战斗开始时，暗属性角色技能槽 + 50%\n作为主要角色编成：暗属性角色发动技能时，<hl>自身技能伤害 + 10%[最大 + 120%]</hl>',
      ],
    }
  },
  {
    id: 151,
    content: {
      '队长': [
        '<or>暗属性角色技能伤害 + 80%</or>\n光属性角色攻击力 + 40%',
        '<hl>暗属性角色技能伤害 + 100%</hl>\n光属性角色攻击力 + 40%',
      ],
      '能力3': [
        '作为主要角色编成：队伍全体角色生命值 80% 以下时，<or>暗属性角色攻击力 + 60%</or>',
        '作为主要角色编成：队伍全体角色生命值 80% 以下时，<hl>暗属性角色攻击力 + 70%</hl>',
      ],
    }
  },
  {
    id: 164,
    content: {
      '队长': [
        '<or>暗属性角色技能伤害 + 60%</or> & 光属性抗性 + 15%',
        '<hl>暗属性角色技能伤害 + 90%</hl> & 光属性抗性 + 15%',
      ],
    }
  },
  {
    id: 174,
    content: {
      '队长': [
        '<or>暗属性角色攻击力 + 20%</or>\n队伍角色从棺柩状态恢复时，暗属性角色攻击力 + 20%[最大 + 120%]',
        '<hl>暗属性角色攻击力 + 50%</hl>\n队伍角色从棺柩状态恢复时，暗属性角色攻击力 + 20%[最大 + 120%]',
      ],
    }
  },
  {
    id: 195,
    content: {
      '队长': [
        '<or>暗属性角色攻击力 + 30%</or>\n自身生命值 30% 以下时，<or>暗属性角色攻击力 + 70%</or>',
        '<hl>暗属性角色攻击力 + 60%</hl>\n自身生命值 30% 以下时，<hl>暗属性角色攻击力 + 90%</hl>',
      ],
    }
  },
  {
    id: 200,
    content: {
      '队长': [
        '暗属性角色生命值 + 10%\n<or>强化弹射伤害 + 50%</or>',
        '暗属性角色生命值 + 10%\n<hl>强化弹射伤害 + 110%</hl>',
      ],
      '能力2': [
        '5 次Power Flip（强化弹射）时，<or>强化弹射伤害 + 10%[最大 + 50%]</or>',
        '5 次Power Flip（强化弹射）时，<hl>强化弹射伤害 + 12%[最大 + 60%]</hl>',
      ],
      '能力3': [
        '作为主要角色编成：每击败4个敌人时，<or>强化弹射伤害 + 8%[最大 + 80%]</or>',
        '作为主要角色编成：每击败4个敌人时，<hl>强化弹射伤害 + 11%[最大 + 110%]</hl>',
      ],
    }
  },
  {
    id: 205,
    content: {
      '能力1': [
        '自身发动技能时，（仅1次）自身技能槽 + 50%',
        '自身发动技能时，（仅1次）自身技能槽 + 50%\n<hl>自身攻击力 + 15%</hl>',
      ],
    }
  },
  {
    id: 209,
    content: {
      '队长': [
        '<or>强化弹射伤害 + 60%</or> & 协力球生命值 + 10%',
        '<hl>强化弹射伤害 + 100%</hl> & 协力球生命值 + 10%',
      ],
      '能力4': [
        '强化弹射伤害 + 15%',
        '强化弹射伤害 + 15% & <hl>棺柩计数 - 2</hl>',
      ]
    }
  },
  {
    id: 221,
    content: {
      '队长': [
        '<or>暗属性角色生命值 + 12%</or> & <or>攻击力 + 40%</or>',
        '<hl>暗属性角色生命值 + 15%</hl> & <hl>攻击力 + 65%</hl>',
      ],
      '能力3': [
        '作为主要角色编成：每击败2个敌人时，<or>暗属性角色攻击力 + 1%[最大 + 30%]</or>\n作为主要角色编成：暗属性角色所受的回复量 + 10%',
        '作为主要角色编成：每击败2个敌人时，<hl>暗属性角色攻击力 + 2%[最大 + 30%]</hl>\n作为主要角色编成：暗属性角色所受的回复量 + 10%',
      ],
    }
  },
  {
    id: 234,
    content: {
      '队长': [
        '<or>暗属性角色攻击力 + 30%</or>\n队伍全体角色生命值 50% 以下时，<or>暗属性角色攻击力 + 70%</or>',
        '<hl>暗属性角色攻击力 + 60%</hl>\n队伍全体角色生命值 50% 以下时，<hl>暗属性角色攻击力 + 90%</hl>',
      ],
      '能力1': [
        '自身的剩余生命值越少，自身攻击力提升【<or>生命值从100%每减少1%，攻击力 + 0.8%[最大 + 60%]</or>】',
        '自身的剩余生命值越少，自身攻击力提升【<hl>生命值从100%每减少1%，攻击力 + 0.8%[最大 + 80%]</hl>】'
      ],
      '能力2': [
        '队伍全体角色生命值 50% 以下时，暗属性角色攻击力 + 30%\n战斗开始时，<or>暗属性角色受到最大生命值 5% 的伤害</or>',
        '队伍全体角色生命值 50% 以下时，暗属性角色攻击力 + 30%\n战斗开始时，<hl>暗属性角色受到最大生命值 10% 的伤害</hl>',
      ],
      '能力3': [
        '作为主要角色编成：暗属性角色的剩余生命值越少，该角色攻击力提升【<or>生命值从100%每减少1%，攻击力 + 0.5%[最大 + 40%]</or>】\n作为主要角色编成：暗属性角色生命值 50% 以上时，暗属性角色发动技能时，该角色受到最大生命值 5% 的伤害',
        '作为主要角色编成：暗属性角色的剩余生命值越少，该角色攻击力提升【<hl>生命值从100%每减少1%，攻击力 + 0.6%[最大 + 60%]</hl>】\n作为主要角色编成：暗属性角色生命值 50% 以上时，暗属性角色发动技能时，该角色受到最大生命值 5% 的伤害'
      ],
    }
  },
  {
    id: 251,
    content: {
      '队长': [
        '暗属性角色生命值 + 15%\n自身从棺柩状态恢复时，<or>暗属性角色技能伤害 + 15%[最大 + 90%]</or>',
        '暗属性角色生命值 + 15%\n自身从棺柩状态恢复时，<hl>暗属性角色技能伤害 + 20%[最大 + 120%]</hl>',
      ],
    }
  },
  {
    id: 261,
    content: {
      '队长': [
        '<or>暗属性角色直接攻击伤害 + 60%</or> & 对弱体效果中的敌人造成的伤害 + 15%（独立伤害乘区2）',
        '<hl>暗属性角色直接攻击伤害 + 80%</hl> & 对弱体效果中的敌人造成的伤害 + 15%（独立伤害乘区2）',
      ],
      '能力1': [
        '<or>暗属性角色直接攻击伤害 + 30%</or>',
        '<hl>暗属性角色直接攻击伤害 + 45%</hl>'
      ],
      '能力2': [
        '对一名敌人赋予的弱体效果数量每达到1，<or>自身对那名敌人造成的直接攻击伤害 + 25%[最大 + 100%]</or>',
        '对一名敌人赋予的弱体效果数量每达到1，<hl>自身对那名敌人造成的直接攻击伤害 + 30%[最大 + 120%]</hl>',
      ],
      '能力3': [
        '作为主要角色编成：对一名敌人赋予的弱体效果数量每达到1，<or>暗属性角色对那名敌人造成的直接攻击伤害 + 25%[最大 + 100%]</or>',
        '作为主要角色编成：对一名敌人赋予的弱体效果数量每达到1，<hl>暗属性角色对那名敌人造成的直接攻击伤害 + 30%[最大 + 120%]</hl>',
      ],
    }
  },
]
const up_datas = {
  'fire': up_data_fire,
  'water': up_data_water,
  'thunder': up_data_thunder,
  'wind': up_data_wind,
  'light': up_data_light,
  'dark': up_data_dark,
}
const alpha = 0.85;
const ele2color = {
  'fire': 'rgba(234,53,75,' + alpha + ')',
  'water': 'rgb(68,137,255,' + alpha + ')',
  'thunder': 'rgb(244,204,36,' + alpha + ')',
  'wind': 'rgb(119,217,47,' + alpha + ')',
  'light': 'rgb(245,255,186,' + alpha + ')',
  'dark': 'rgb(90,57,95,' + alpha + ')',
}
const ele2border_color = {
  'fire': 'rgb(234,53,75)',
  'water': 'rgb(68,137,255)',
  'thunder': 'rgb(244,204,36)',
  'wind': 'rgb(119,217,47)',
  'light': 'rgb(136,136,136)',
  'dark': 'rgb(90,57,95)',
}
const ele2name = {
  'fire': '火属性',
  'water': '水属性',
  'thunder': '雷属性',
  'wind': '风属性',
  'light': '光属性',
  'dark': '暗属性',
}
function format_content(content) {
  let s = '<p>'
  s += content.replaceAll('\n', '</p><p>')
  s += '</p>'
  s = s.replaceAll('火属性', '<img style="width: 18px; vertical-align: bottom; margin: 0 2px;" src="/assets/worldflipper/icon/desc_fire.png" alt=""/>')
  s = s.replaceAll('水属性', '<img style="width: 18px; vertical-align: bottom; margin: 0 2px;" src="/assets/worldflipper/icon/desc_water.png" alt=""/>')
  s = s.replaceAll('雷属性', '<img style="width: 18px; vertical-align: bottom; margin: 0 2px;" src="/assets/worldflipper/icon/desc_thunder.png" alt=""/>')
  s = s.replaceAll('风属性', '<img style="width: 18px; vertical-align: bottom; margin: 0 2px;" src="/assets/worldflipper/icon/desc_wind.png" alt=""/>')
  s = s.replaceAll('光属性', '<img style="width: 18px; vertical-align: bottom; margin: 0 2px;" src="/assets/worldflipper/icon/desc_light.png" alt=""/>')
  s = s.replaceAll('暗属性', '<img style="width: 18px; vertical-align: bottom; margin: 0 2px;" src="/assets/worldflipper/icon/desc_dark.png" alt=""/>')
  s = s.replaceAll('作为主要角色编成：', '<img style="width: 18px; vertical-align: bottom; margin: 0 2px;" src="/assets/worldflipper/icon/desc_main.png" alt=""/>')
  return s
}
</script>

<template>
  <div style="
      background: url(/assets/worldflipper/ui/background_cut_official.png);
      background-size: 136px;
      background-position-x: -10px;
      background-position-y: -10px;
      image-rendering: pixelated;
      width: fit-content;
      padding: 16px;
      border-radius: 16px;
      box-shadow: 0 0 8px #000000a5;
">
  <div
      style="
        display: flex;
        width: 1036px;
        padding: 16px 0;
        /*background-color: #00ff00;*/
        flex-direction: row;
        flex-wrap: wrap;
        justify-content: space-evenly;
        /* background: url(/assets/worldflipper/ui/background_cut_official.png); */
        /* background-size: 136px; */
        /* background-position-x: -10px; */
        /* background-position-y: -10px; */
        /* image-rendering: pixelated; */
        align-items: flex-start;
      "
  >

  <!--  v-for="i in Object.keys(unit_data)"-->
    <div
        style="
          width: 998px;
          margin: 8px;
          display: flex;
          image-rendering: initial;
          flex-direction: row;
          /*background-color: rgb(234,53,75);*/
          /*padding: 16px;*/
          /*padding: 3px;*/
          border-radius: 16px;
          font-family: Inter, -apple-system, BlinkMacSystemFont, 'Segoe UI', Roboto, Oxygen, Ubuntu, Cantarell, 'Fira Sans', 'Droid Sans', 'Helvetica Neue', sans-serif;
        "
        v-for="(up_data, element_id) in up_datas"
        :style="{
          'background-color': ele2color[element_id]
        }"
    >
      <div
          style="
            background-color: white;
            width: 31px;
            border-top-left-radius: 13px;
            border-bottom-left-radius: 13px;
            display: flex;
            flex-direction: column;
            align-items: center;
            justify-content: center;
            border: 3px solid;
            box-sizing: content-box;
          "
          :style="
          {
            'border-color': ele2border_color[element_id],
            // 'color': element_id === 'light' ? 'rgb(136,136,136)' : 'white'
          }
          "
      >
        <img style="width: 28px; height: 28px;" :src="'/assets/worldflipper/icon/' + element_id + '.png'" alt=""/>
        <p style="font-size: 24px; width: 24px; line-height: 28px; font-weight: bold; color: black;">
          {{ ele2name[element_id] }}
        </p>
      </div>
      <div
        style="
          display: flex;
          flex-direction: column;
          width: 100%;
          padding: 18px 28px 18px 16px;
          /*color: white;*/
          /*color: black;*/
          font-weight: 500;
        "
        :style="
        {
          'color': (['light'].includes(element_id)) ? 'rgb(50,50,50)' : 'rgb(250,250,250)'
        }
        "
      >
        <div
            style="
              display: flex;
              /*padding: 0 0 0 7px;*/
              /*margin: 0 15px 0 7px;*/
              flex-direction: row;
              width: 100%;
              /*border: 3px solid #ffffff60;*/
              /*box-sizing: border-box;*/
              margin: 4px;
              border: 3px solid #ffffff60;
              /*background-color: #ffffff28;*/
              box-sizing: border-box;
              /*box-shadow: 0 0 3px white;*/
              border-radius: 8px;
              /*flex-direction: row;*/
              /*width: 100%;*/
            "
            :style="{'background-color': ['light', 'thunder', 'wind', 'fire', 'water', 'dark'].includes(element_id) ? 'rgba(0,0,0,0.12)' : 'rgba(255,255,255,0.12)'}"
        >
          <div style="display: flex; flex-direction: column; width: 100%;">

            <div style="display: flex; width: 100%; height: 100%;">

              <div
                  style="
              box-shadow: 0 0 1px black;
              padding: 4px;
              min-width: 98px;
              /*color: white;*/
              /*color: black;*/
              text-align: center;
              font-size: 18px;
              border-radius: 6px 0 0 6px;
            "
              >
                角色
              </div>
              <div
                  style="
              box-shadow: 0 0 1px black;
              /*flex: 1;*/
              padding: 4px;
              font-size: 16px;
              /*color: white;*/
              /*width: 24px;*/
              width: 60px;
              display: flex;
              align-items: center;
            "
              >
              </div>
              <div
                  style="
              box-shadow: 0 0 1px black;
              flex: 1;
              padding: 4px;
              /*color: white;*/
              text-align: center;
              font-size: 18px;
            "
              >
                上修前
              </div>
              <div
                  style="
              box-shadow: 0 0 1px black;
              flex: 1;
              padding: 4px;
              /*color: white;*/
              text-align: center;
              font-size: 18px;
              border-radius:  0 6px 6px 0;
            "
              >
                上修后
              </div>
            </div>
          </div>
        </div>
        <div
            v-if="Object.keys(unit_data).length"
            v-for="i in up_data"
            style="
              display: flex;
              margin: 8px 4px;
              border: 3px solid #ffffff60;
              /*background-color: #ffffff28;*/
              box-sizing: border-box;
              /*box-shadow: 0 0 3px white;*/
              border-radius: 8px;
              flex-direction: row;
              width: 100%;
            "
            :style="{'background-color': ['light', 'thunder', 'wind', 'fire', 'water', 'dark'].includes(element_id) ? 'rgba(0,0,0,0.12)' : 'rgba(255,255,255,0.12)'}"
        >
          <div
              style="
              /*box-shadow: 0 0 1px black;*/
            "
          >
            <UnitPicInfo :unit_data="unit_data[i.id]" style="margin: 4px;"/>
          </div>
          <div style="display: flex; flex-direction: column; width: 100%;">

            <div v-for="(j, name) in i.content" style="display: flex; width: 100%; height: 100%;">
              <div
                  style="
                    box-shadow: 0 0 1px black;
                    /*flex: 1;*/
                    padding: 16px 4px;
                    font-size: 16px;
                    /*color: white;*/
                    /*width: 24px;*/
                    width: 60px;
                    display: flex;
                    align-items: center;
                    justify-content: center;
                    /*background-color:#ffffff55;*/
                    /*flex-direction: column;*/
                  "
              >
                <p style="text-align: center; font-weight: 600;">
                  {{ name }}
                </p>
              </div>
              <div
                  style="
                    box-shadow: 0 0 1px black;
                    flex: 1;
                    padding: 8px;
                    font-size: 16px;
                    /*color: white;*/
                    display: flex;
                    /*text-align: center;*/
                    width: fit-content;
                    flex-direction: column;
                    justify-content: center;
                    /*background-color:#ffffff22;*/
                  "
              >
                <div v-html="format_content(j[0])"></div>
              </div>
              <div
                  style="
                    box-shadow: 0 0 1px black;
                    flex: 1;
                    padding: 8px;
                    font-size: 16px;
                    /*color: white;*/
                    display: flex;
                    /*text-align: center;*/
                    width: fit-content;
                    flex-direction: column;
                    justify-content: center;
                    /*background-color:#ffffff55;*/
                  "
              >
                <div v-html="format_content(j[1])"></div>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
  </div>
</div>
</template>

<style scoped>
</style>
<style>
p {
  margin-bottom: 4px;
}
hl {
  background-color: rgba(255, 115, 0, 0.65);
  padding: 0 4px 2px;
  border-radius: 6px;
}
or {
  background-color: rgba(56, 183, 48, 0.65);
  padding: 0 4px 2px;
  border-radius: 6px;
}
</style>